{
    "2025-03-03": {
        "First_Reading": {
            "title": "Book of Sirach17,20-24.",
            "reading": "To the penitent God provides a way back, he encourages those who are losing hopeand has chosen for them the lot of truth. Return to the LORD and give up sin, pray to him and make your offenses few.\nTurn again to the Most High and away from sin, hate intensely what he loathes; and know the justice and judgments of God, stand firm in the way set before you, in prayer to the Most High God.\nWho in the nether world can glorify the Most High in place of the living who offer their praise? Dwell no longer in the error of the ungodly, but offer your praise before death.\nNo more can the dead give praise than those who have never lived; they glorify the LORD who are alive and well.\nHow great the mercy of the LORD, his forgiveness of those who return to him!"
        },
        "Psalm": {
            "title": "Psalms32(31),1-2.5.6.7.",
            "reading": "Blessed is he whose fault is taken away,whose sin is covered.\nBlessed the man to whom the LORD imputes not guilt,in whose spirit there is no guile.\nThen I acknowledged my sin to you,my guilt I covered not.I said, “I confess my faults to the LORD,”and you took away the guilt of my sin.\nFor this shall every faithful man pray to youin time of stress.Though deep waters overflow,they shall not reach him.\nYou are my shelter; from distress you will preserve me;with glad cries of freedom you will ring me round."
        },
        "Second_Reading": {
            "title": "Holy Gospel of Jesus Christ according to Saint Mark10,17-27.",
            "reading": "As Jesus was setting out on a journey, a man ran up, knelt down before him, and asked him, \"Good teacher, what must I do to inherit eternal life?\"\nJesus answered him, \"Why do you call me good? No one is good but God alone.\nYou know the commandments: 'You shall not kill; you shall not commit adultery; you shall not steal; you shall not bear false witness; you shall not defraud; honor your father and your mother.'\"\nHe replied and said to him, \"Teacher, all of these I have observed from my youth.\"\nJesus, looking at him, loved him and said to him, \"You are lacking in one thing. Go, sell what you have, and give to (the) poor and you will have treasure in heaven; then come, follow me.\"\nAt that statement his face fell, and he went away sad, for he had many possessions.\nJesus looked around and said to his disciples, \"How hard it is for those who have wealth to enter the kingdom of God!\"\nThe disciples were amazed at his words. So Jesus again said to them in reply, \"Children, how hard it is to enter the kingdom of God!\nIt is easier for a camel to pass through (the) eye of (a) needle than for one who is rich to enter the kingdom of God.\"\nThey were exceedingly astonished and said among themselves, \"Then who can be saved?\"\nJesus looked at them and said, \"For human beings it is impossible, but not for God. All things are possible for God.\""
        }
    },
    "2025-03-04": {
        "First_Reading": {
            "title": "Book of Sirach35,1-12.",
            "reading": "To keep the law is a great oblation, and he who observes the  commandments sacrifices a peace offering.\nIn works of charity one offers fine flour, and when he gives alms he presents his sacrifice of praise.\nTo refrain from evil pleases the LORD, and to avoid injustice is an atonement.\nAppear not before the LORD empty-handed, for all that you offer is in fulfillment of the precepts.\nThe just man's offering enriches the altar and rises as a sweet odor before the Most High.\nThe just man's sacrifice is most pleasing, nor will it ever be forgotten.\nIn generous spirit pay homage to the LORD, be not sparing of freewill gifts.\nWith each contribution show a cheerful countenance, and pay your tithes in a spirit of joy.\nGive to the Most High as he has given to you, generously, according to your means.\nFor the LORD is one who always repays, and he will give back to you sevenfold.\nBut offer no bribes, these he does not accept! Trust not in sacrifice of the fruits of extortion,\nFor he is a God of justice, who knows no favorites."
        },
        "Psalm": {
            "title": "Psalms50(49),5-6.7-8.14.23.",
            "reading": "\"Gather my faithful ones before me,those who have made a covenant with me by sacrifice.\"\nAnd the heavens proclaim his justice;for God himself is the judge.\n“Hear, my people, and I will speak;Israel, I will testify against you;God, your God, am I.\n\"Not for your sacrifices do I rebuke you,for your burnt offerings are before me always.”\n“Offer to God praise as your sacrificeand fulfill your vows to the Most High.\nHe that offers praise as a sacrifice glorifies me;and to him that goes the right way I will show the salvation of God.”"
        },
        "Second_Reading": {
            "title": "Holy Gospel of Jesus Christ according to Saint Mark10,28-31.",
            "reading": "Peter began to say to Jesus, \"We have given up everything and followed you.\"\nJesus said, \"Amen, I say to you, there is no one who has given up house or brothers or sisters or mother or father or children or lands for my sake and for the sake of the gospel\nwho will not receive a hundred times more now in this present age: houses and brothers and sisters and mothers and children and lands, with persecutions, and eternal life in the age to come.\"\nBut many that are first will be last, and (the) last will be first.\""
        }
    },
    "2025-03-05": {
        "First_Reading": {
            "title": "Book of Joel2,12-18.",
            "reading": "Even now, says the LORD, return to me with your whole heart, with fasting, and weeping, and mourning;\nRend your hearts, not your garments, and return to the LORD, your God. For gracious and merciful is he, slow to anger, rich in kindness, and relenting in punishment.\nPerhaps he will again relent and leave behind him a blessing, Offerings and libations for the LORD, your God.\nBlow the trumpet in Zion! proclaim a fast, call an assembly;\nGather the people, notify the congregation; Assemble the elders, gather the children and the infants at the breast; Let the bridegroom quit his room, and the bride her chamber.\nBetween the porch and the altar let the priests, the ministers of the LORD, weep, And say, \"Spare, O LORD, your people, and make not your heritage a reproach, with the nations ruling over them! Why should they say among the peoples, 'Where is their God?'\"\nThen the LORD was stirred to concern for his land and took pity on his people."
        },
        "Psalm": {
            "title": "Psalms51(50),3-4.5-6ab.12-13.14.17.",
            "reading": "Have mercy on me, O God, in your goodness;in the greatness of your compassion wipe out my offense.\nThoroughly wash me from my guiltand of my sin cleanse me.\nFor I acknowledge my offense,and my sin is before me always:\n\"Against you only have I sinned,\nand done what is evil in your sight.\"\nA clean heart create for me, O God,and a steadfast spirit renew within me.\nCast me not out from your presence,and your Holy Spirit take not from me.\nGive me back the joy of your salvation,and a willing spirit sustain in me.\nO Lord, open my lips,and my mouth shall proclaim your praise."
        },
        "Second_Reading": {
            "title": "Second Letter to the Corinthians5,20-21.6,1-2.",
            "reading": "Brothers and sisters: We are ambassadors for Christ, as if God were appealing through us. We implore you on behalf of Christ, be reconciled to God.\nFor our sake he made him to be sin who did not know sin, so that we might become the righteousness of God in him.\nWorking together, then, we appeal to you not to receive the grace of God in vain.\nFor he says: \"In an acceptable time I heard you, and on the day of salvation I helped you.\" Behold, now is a very acceptable time; behold, now is the day of salvation."
        },
        "Gospel": {
            "title": "Holy Gospel of Jesus Christ according to Saint Matthew6,1-6.16-18.",
            "reading": "Jesus said to his disciples: \"Take care not to perform righteous deeds in order that people may see them; otherwise, you will have no recompense from your heavenly Father.\nWhen you give alms, do not blow a trumpet before you, as the hypocrites do in the synagogues and in the streets to win the praise of others. Amen, I say to you, they have received their reward.\nBut when you give alms, do not let your left hand know what your right is doing,\nso that your almsgiving may be secret. And your Father who sees in secret will repay you.\nWhen you pray, do not be like the hypocrites, who love to stand and pray in the synagogues and on street corners so that others may see them. Amen, I say to you, they have received their reward.\nBut when you pray, go to your inner room, close the door, and pray to your Father in secret. And your Father who sees in secret will repay you.\nWhen you fast, do not look gloomy like the hypocrites. They neglect their appearance, so that they may appear to others to be fasting. Amen, I say to you, they have received their reward.\nBut when you fast, anoint your head and wash your face,\nso that you may not appear to be fasting, except to your Father who is hidden. And your Father who sees what is hidden will repay you.\""
        }
    }
}