{
    "2025-03-03": {
        "First_Reading": {
            "title": "Book of Sirach17,20-24.",
            "reading": "To the penitent God provides a way back, he encourages those who are losing hopeand has chosen for them the lot of truth. Return to the LORD and give up sin, pray to him and make your offenses few.\nTurn again to the Most High and away from sin, hate intensely what he loathes; and know the justice and judgments of God, stand firm in the way set before you, in prayer to the Most High God.\nWho in the nether world can glorify the Most High in place of the living who offer their praise? Dwell no longer in the error of the ungodly, but offer your praise before death.\nNo more can the dead give praise than those who have never lived; they glorify the LORD who are alive and well.\nHow great the mercy of the LORD, his forgiveness of those who return to him!"
        },
        "Psalm": {
            "title": "Psalms32(31),1-2.5.6.7.",
            "reading": "Blessed is he whose fault is taken away,whose sin is covered.\nBlessed the man to whom the LORD imputes not guilt,in whose spirit there is no guile.\nThen I acknowledged my sin to you,my guilt I covered not.I said, “I confess my faults to the LORD,”and you took away the guilt of my sin.\nFor this shall every faithful man pray to youin time of stress.Though deep waters overflow,they shall not reach him.\nYou are my shelter; from distress you will preserve me;with glad cries of freedom you will ring me round."
        },
        "Second_Reading": {
            "title": "Holy Gospel of Jesus Christ according to Saint Mark10,17-27.",
            "reading": "As Jesus was setting out on a journey, a man ran up, knelt down before him, and asked him, \"Good teacher, what must I do to inherit eternal life?\"\nJesus answered him, \"Why do you call me good? No one is good but God alone.\nYou know the commandments: 'You shall not kill; you shall not commit adultery; you shall not steal; you shall not bear false witness; you shall not defraud; honor your father and your mother.'\"\nHe replied and said to him, \"Teacher, all of these I have observed from my youth.\"\nJesus, looking at him, loved him and said to him, \"You are lacking in one thing. Go, sell what you have, and give to (the) poor and you will have treasure in heaven; then come, follow me.\"\nAt that statement his face fell, and he went away sad, for he had many possessions.\nJesus looked around and said to his disciples, \"How hard it is for those who have wealth to enter the kingdom of God!\"\nThe disciples were amazed at his words. So Jesus again said to them in reply, \"Children, how hard it is to enter the kingdom of God!\nIt is easier for a camel to pass through (the) eye of (a) needle than for one who is rich to enter the kingdom of God.\"\nThey were exceedingly astonished and said among themselves, \"Then who can be saved?\"\nJesus looked at them and said, \"For human beings it is impossible, but not for God. All things are possible for God.\""
        }
    },
    "2025-03-04": {
        "First_Reading": {
            "title": "Book of Sirach35,1-12.",
            "reading": "To keep the law is a great oblation, and he who observes the  commandments sacrifices a peace offering.\nIn works of charity one offers fine flour, and when he gives alms he presents his sacrifice of praise.\nTo refrain from evil pleases the LORD, and to avoid injustice is an atonement.\nAppear not before the LORD empty-handed, for all that you offer is in fulfillment of the precepts.\nThe just man's offering enriches the altar and rises as a sweet odor before the Most High.\nThe just man's sacrifice is most pleasing, nor will it ever be forgotten.\nIn generous spirit pay homage to the LORD, be not sparing of freewill gifts.\nWith each contribution show a cheerful countenance, and pay your tithes in a spirit of joy.\nGive to the Most High as he has given to you, generously, according to your means.\nFor the LORD is one who always repays, and he will give back to you sevenfold.\nBut offer no bribes, these he does not accept! Trust not in sacrifice of the fruits of extortion,\nFor he is a God of justice, who knows no favorites."
        },
        "Psalm": {
            "title": "Psalms50(49),5-6.7-8.14.23.",
            "reading": "\"Gather my faithful ones before me,those who have made a covenant with me by sacrifice.\"\nAnd the heavens proclaim his justice;for God himself is the judge.\n“Hear, my people, and I will speak;Israel, I will testify against you;God, your God, am I.\n\"Not for your sacrifices do I rebuke you,for your burnt offerings are before me always.”\n“Offer to God praise as your sacrificeand fulfill your vows to the Most High.\nHe that offers praise as a sacrifice glorifies me;and to him that goes the right way I will show the salvation of God.”"
        },
        "Second_Reading": {
            "title": "Holy Gospel of Jesus Christ according to Saint Mark10,28-31.",
            "reading": "Peter began to say to Jesus, \"We have given up everything and followed you.\"\nJesus said, \"Amen, I say to you, there is no one who has given up house or brothers or sisters or mother or father or children or lands for my sake and for the sake of the gospel\nwho will not receive a hundred times more now in this present age: houses and brothers and sisters and mothers and children and lands, with persecutions, and eternal life in the age to come.\"\nBut many that are first will be last, and (the) last will be first.\""
        }
    },
    "2025-03-05": {
        "First_Reading": {
            "title": "Book of Joel2,12-18.",
            "reading": "Even now, says the LORD, return to me with your whole heart, with fasting, and weeping, and mourning;\nRend your hearts, not your garments, and return to the LORD, your God. For gracious and merciful is he, slow to anger, rich in kindness, and relenting in punishment.\nPerhaps he will again relent and leave behind him a blessing, Offerings and libations for the LORD, your God.\nBlow the trumpet in Zion! proclaim a fast, call an assembly;\nGather the people, notify the congregation; Assemble the elders, gather the children and the infants at the breast; Let the bridegroom quit his room, and the bride her chamber.\nBetween the porch and the altar let the priests, the ministers of the LORD, weep, And say, \"Spare, O LORD, your people, and make not your heritage a reproach, with the nations ruling over them! Why should they say among the peoples, 'Where is their God?'\"\nThen the LORD was stirred to concern for his land and took pity on his people."
        },
        "Psalm": {
            "title": "Psalms51(50),3-4.5-6ab.12-13.14.17.",
            "reading": "Have mercy on me, O God, in your goodness;in the greatness of your compassion wipe out my offense.\nThoroughly wash me from my guiltand of my sin cleanse me.\nFor I acknowledge my offense,and my sin is before me always:\n\"Against you only have I sinned,\nand done what is evil in your sight.\"\nA clean heart create for me, O God,and a steadfast spirit renew within me.\nCast me not out from your presence,and your Holy Spirit take not from me.\nGive me back the joy of your salvation,and a willing spirit sustain in me.\nO Lord, open my lips,and my mouth shall proclaim your praise."
        },
        "Second_Reading": {
            "title": "Second Letter to the Corinthians5,20-21.6,1-2.",
            "reading": "Brothers and sisters: We are ambassadors for Christ, as if God were appealing through us. We implore you on behalf of Christ, be reconciled to God.\nFor our sake he made him to be sin who did not know sin, so that we might become the righteousness of God in him.\nWorking together, then, we appeal to you not to receive the grace of God in vain.\nFor he says: \"In an acceptable time I heard you, and on the day of salvation I helped you.\" Behold, now is a very acceptable time; behold, now is the day of salvation."
        },
        "Gospel": {
            "title": "Holy Gospel of Jesus Christ according to Saint Matthew6,1-6.16-18.",
            "reading": "Jesus said to his disciples: \"Take care not to perform righteous deeds in order that people may see them; otherwise, you will have no recompense from your heavenly Father.\nWhen you give alms, do not blow a trumpet before you, as the hypocrites do in the synagogues and in the streets to win the praise of others. Amen, I say to you, they have received their reward.\nBut when you give alms, do not let your left hand know what your right is doing,\nso that your almsgiving may be secret. And your Father who sees in secret will repay you.\nWhen you pray, do not be like the hypocrites, who love to stand and pray in the synagogues and on street corners so that others may see them. Amen, I say to you, they have received their reward.\nBut when you pray, go to your inner room, close the door, and pray to your Father in secret. And your Father who sees in secret will repay you.\nWhen you fast, do not look gloomy like the hypocrites. They neglect their appearance, so that they may appear to others to be fasting. Amen, I say to you, they have received their reward.\nBut when you fast, anoint your head and wash your face,\nso that you may not appear to be fasting, except to your Father who is hidden. And your Father who sees what is hidden will repay you.\""
        }
    },
    "2025-03-06": {
        "First_Reading": {
            "title": "Book of Deuteronomy30,15-20.",
            "reading": "Moses said to the people: \"Today I have set before you life and prosperity, death and doom.\nIf you obey the commandments of the LORD, your God, which I enjoin on you today, loving him, and walking in his ways, and keeping his commandments, statutes and decrees, you will live and grow numerous, and the LORD, your God, will bless you in the land you are entering to occupy.\nIf, however, you turn away your hearts and will not listen, but are led astray and adore and serve other gods,\nI tell you now that you will certainly perish; you will not have a long life on the land which you are crossing the Jordan to enter and occupy.\nI call heaven and earth today to witness against you: I have set before you life and death, the blessing and the curse. Choose life, then, that you and your descendants may live,\nby loving the LORD, your God, heeding his voice, and holding fast to him. For that will mean life for you, a long life for you to live on the land which the LORD swore he would give to your fathers Abraham, Isaac and Jacob.\""
        },
        "Psalm": {
            "title": "Psalms1,1-2.3.4.6.",
            "reading": "Blessed the man who follows notthe counsel of the wickedNor walks in the way of sinners,nor sits in the company of the insolent,\nBut delights in the law of the LORDand meditates on his law day and night.\nHe is like a treeplanted near running water,that yields its fruit in due season,and whose leaves never fade.Whatever he does, prospers.\nNot so, the wicked, not so;they are like chaff which the wind drives away.\nFor the LORD watches over the way of the just,but the way of the wicked vanishes."
        },
        "Second_Reading": {
            "title": "Holy Gospel of Jesus Christ according to Saint Luke9,22-25.",
            "reading": "Jesus said to his disciples: \"The Son of Man must suffer greatly and be rejected by the elders, the chief priests, and the scribes, and be killed and on the third day be raised.\"\nThen he said to all, \"If anyone wishes to come after me, he must deny himself and take up his cross daily and follow me.\nFor whoever wishes to save his life will lose it, but whoever loses his life for my sake will save it.\nWhat profit is there for one to gain the whole world yet lose or forfeit himself?\""
        }
    },
    "2025-03-07": {
        "First_Reading": {
            "title": "Book of Isaiah58,1-9a.",
            "reading": "Thus says the Lord GOD: Cry out full-throated and unsparingly, lift up your voice like a trumpet blast;  Tell my people their wickedness, and the house of Jacob their sins.\nThey seek me day after day, and desire to know my ways, Like a nation that has done what is just and not abandoned the law of their God; They ask me to declare what is due them, pleased to gain access to God.\n\"Why do we fast, and you do not see it? afflict ourselves, and you take no note of it?\" Lo, on your fast day you carry out your own pursuits, and drive all your laborers.\nYes, your fast ends in quarreling and fighting, striking with wicked claw. Would that today you might fast so as to make your voice heard on high!\nIs this the manner of fasting I wish, of keeping a day of penance: That a man bow his head like a reed, and lie in sackcloth and ashes? Do you call this a fast, a day acceptable to the LORD?\nThis, rather, is the fasting that I wish: releasing those bound unjustly, untying the thongs of the yoke; Setting free the oppressed, breaking every yoke;\nSharing your bread with the hungry, sheltering the oppressed and the homeless; Clothing the naked when you see them, and not turning your back on your own.\nThen your light shall break forth like the dawn, and your wound shall quickly be healed; Your vindication shall go before you, and the glory of the LORD shall be your rear guard.\nThen you shall call, and the LORD will answer, you shall cry for help, and he will say: Here I am!"
        },
        "Psalm": {
            "title": "Psalms51(50),3-4.5-6ab.18-19.",
            "reading": "Have mercy on me, O God, in your goodness;in the greatness of your compassion wipe out my offense.\nThoroughly wash me from my guiltand of my sin cleanse me.\nFor I acknowledge my offense,and my sin is before me always:\n\"Against you only have I sinned,\nand done what is evil in your sight.\"\nFor you are not pleased with sacrifices;should I offer a burnt offering, you would not accept it.\nMy sacrifice, O God, is a contrite spirit;a heart contrite and humbled, O God, you will not spurn."
        },
        "Second_Reading": {
            "title": "Holy Gospel of Jesus Christ according to Saint Matthew9,14-15.",
            "reading": "The disciples of John approached Jesus and said, \"Why do we and the Pharisees fast much, but your disciples do not fast?\"\nJesus answered them, \"Can the wedding guests mourn as long as the bridegroom is with them? The days will come when the bridegroom is taken away from them, and then they will fast.\""
        }
    },
    "2025-03-08": {
        "First_Reading": {
            "title": "Book of Isaiah58,9b-14.",
            "reading": "Thus says the LORD: If you remove from your midst oppression, false accusation and malicious speech;\nIf you bestow your bread on the hungry and satisfy the afflicted; Then light shall rise for you in the darkness, and the gloom shall become for you like midday.\nThen the LORD will guide you always and give you plenty even on the parched land. He will renew your strength, and you shall be like a watered garden, like a spring whose water never fails.\nThe ancient ruins shall be rebuilt for your sake, and the foundations from ages past you shall raise up; \"Repairer of the breach,\" they shall call you, \"Restorer of ruined homesteads.\"\nIf you hold back your foot on the sabbath from following your own pursuits on my holy day; If you call the sabbath a delight, and the LORD'S holy day honorable; If you honor it by not following your ways, seeking your own interests, or speaking with malice--\nThen you shall delight in the LORD, and I will make you ride on the heights of the earth; I will nourish you with the heritage of Jacob, your father, for the mouth of the LORD has spoken."
        },
        "Psalm": {
            "title": "Psalms86(85),1-2.3-4.5-6.",
            "reading": "Incline your ear, O LORD; answer me,for I am afflicted and poor.\nKeep my life, for I am devoted to you;save your servant who trusts in you.\nYou are my God.Have mercy on me, O Lord,for to you I call all the day.\nGladden the soul of your servant,for to you, O Lord, I lift up my soul.\nFor you, O Lord, are good and forgiving,abounding in kindness to all who call upon you.\nHearken, O LORD, to my prayerand attend to the sound of my pleading."
        },
        "Second_Reading": {
            "title": "Holy Gospel of Jesus Christ according to Saint Luke5,27-32.",
            "reading": "Jesus saw a tax collector named Levi sitting at the customs post. He said to him, \"Follow me.\"\nAnd leaving everything behind, he got up and followed him.\nThen Levi gave a great banquet for him in his house, and a large crowd of tax collectors and others were at table with them.\nThe Pharisees and their scribes complained to his disciples, saying, \"Why do you eat and drink with tax collectors and sinners?\"\nJesus said to them in reply, \"Those who are healthy do not need a physician, but the sick do.\nI have not come to call the righteous to repentance but sinners.\""
        }
    }
}