{
    "2025-03-03": {
        "First_Reading": {
            "title": "Book of Sirach17,20-24.",
            "reading": "To the penitent God provides a way back, he encourages those who are losing hopeand has chosen for them the lot of truth. Return to the LORD and give up sin, pray to him and make your offenses few.\nTurn again to the Most High and away from sin, hate intensely what he loathes; and know the justice and judgments of God, stand firm in the way set before you, in prayer to the Most High God.\nWho in the nether world can glorify the Most High in place of the living who offer their praise? Dwell no longer in the error of the ungodly, but offer your praise before death.\nNo more can the dead give praise than those who have never lived; they glorify the LORD who are alive and well.\nHow great the mercy of the LORD, his forgiveness of those who return to him!"
        },
        "Psalm": {
            "title": "Psalms32(31),1-2.5.6.7.",
            "reading": "Blessed is he whose fault is taken away,whose sin is covered.\nBlessed the man to whom the LORD imputes not guilt,in whose spirit there is no guile.\nThen I acknowledged my sin to you,my guilt I covered not.I said, “I confess my faults to the LORD,”and you took away the guilt of my sin.\nFor this shall every faithful man pray to youin time of stress.Though deep waters overflow,they shall not reach him.\nYou are my shelter; from distress you will preserve me;with glad cries of freedom you will ring me round."
        },
        "Second_Reading": {
            "title": "Holy Gospel of Jesus Christ according to Saint Mark10,17-27.",
            "reading": "As Jesus was setting out on a journey, a man ran up, knelt down before him, and asked him, \"Good teacher, what must I do to inherit eternal life?\"\nJesus answered him, \"Why do you call me good? No one is good but God alone.\nYou know the commandments: 'You shall not kill; you shall not commit adultery; you shall not steal; you shall not bear false witness; you shall not defraud; honor your father and your mother.'\"\nHe replied and said to him, \"Teacher, all of these I have observed from my youth.\"\nJesus, looking at him, loved him and said to him, \"You are lacking in one thing. Go, sell what you have, and give to (the) poor and you will have treasure in heaven; then come, follow me.\"\nAt that statement his face fell, and he went away sad, for he had many possessions.\nJesus looked around and said to his disciples, \"How hard it is for those who have wealth to enter the kingdom of God!\"\nThe disciples were amazed at his words. So Jesus again said to them in reply, \"Children, how hard it is to enter the kingdom of God!\nIt is easier for a camel to pass through (the) eye of (a) needle than for one who is rich to enter the kingdom of God.\"\nThey were exceedingly astonished and said among themselves, \"Then who can be saved?\"\nJesus looked at them and said, \"For human beings it is impossible, but not for God. All things are possible for God.\""
        }
    },
    "2025-03-04": {
        "First_Reading": {
            "title": "Book of Sirach35,1-12.",
            "reading": "To keep the law is a great oblation, and he who observes the  commandments sacrifices a peace offering.\nIn works of charity one offers fine flour, and when he gives alms he presents his sacrifice of praise.\nTo refrain from evil pleases the LORD, and to avoid injustice is an atonement.\nAppear not before the LORD empty-handed, for all that you offer is in fulfillment of the precepts.\nThe just man's offering enriches the altar and rises as a sweet odor before the Most High.\nThe just man's sacrifice is most pleasing, nor will it ever be forgotten.\nIn generous spirit pay homage to the LORD, be not sparing of freewill gifts.\nWith each contribution show a cheerful countenance, and pay your tithes in a spirit of joy.\nGive to the Most High as he has given to you, generously, according to your means.\nFor the LORD is one who always repays, and he will give back to you sevenfold.\nBut offer no bribes, these he does not accept! Trust not in sacrifice of the fruits of extortion,\nFor he is a God of justice, who knows no favorites."
        },
        "Psalm": {
            "title": "Psalms50(49),5-6.7-8.14.23.",
            "reading": "\"Gather my faithful ones before me,those who have made a covenant with me by sacrifice.\"\nAnd the heavens proclaim his justice;for God himself is the judge.\n“Hear, my people, and I will speak;Israel, I will testify against you;God, your God, am I.\n\"Not for your sacrifices do I rebuke you,for your burnt offerings are before me always.”\n“Offer to God praise as your sacrificeand fulfill your vows to the Most High.\nHe that offers praise as a sacrifice glorifies me;and to him that goes the right way I will show the salvation of God.”"
        },
        "Second_Reading": {
            "title": "Holy Gospel of Jesus Christ according to Saint Mark10,28-31.",
            "reading": "Peter began to say to Jesus, \"We have given up everything and followed you.\"\nJesus said, \"Amen, I say to you, there is no one who has given up house or brothers or sisters or mother or father or children or lands for my sake and for the sake of the gospel\nwho will not receive a hundred times more now in this present age: houses and brothers and sisters and mothers and children and lands, with persecutions, and eternal life in the age to come.\"\nBut many that are first will be last, and (the) last will be first.\""
        }
    },
    "2025-03-05": {
        "First_Reading": {
            "title": "Book of Joel2,12-18.",
            "reading": "Even now, says the LORD, return to me with your whole heart, with fasting, and weeping, and mourning;\nRend your hearts, not your garments, and return to the LORD, your God. For gracious and merciful is he, slow to anger, rich in kindness, and relenting in punishment.\nPerhaps he will again relent and leave behind him a blessing, Offerings and libations for the LORD, your God.\nBlow the trumpet in Zion! proclaim a fast, call an assembly;\nGather the people, notify the congregation; Assemble the elders, gather the children and the infants at the breast; Let the bridegroom quit his room, and the bride her chamber.\nBetween the porch and the altar let the priests, the ministers of the LORD, weep, And say, \"Spare, O LORD, your people, and make not your heritage a reproach, with the nations ruling over them! Why should they say among the peoples, 'Where is their God?'\"\nThen the LORD was stirred to concern for his land and took pity on his people."
        },
        "Psalm": {
            "title": "Psalms51(50),3-4.5-6ab.12-13.14.17.",
            "reading": "Have mercy on me, O God, in your goodness;in the greatness of your compassion wipe out my offense.\nThoroughly wash me from my guiltand of my sin cleanse me.\nFor I acknowledge my offense,and my sin is before me always:\n\"Against you only have I sinned,\nand done what is evil in your sight.\"\nA clean heart create for me, O God,and a steadfast spirit renew within me.\nCast me not out from your presence,and your Holy Spirit take not from me.\nGive me back the joy of your salvation,and a willing spirit sustain in me.\nO Lord, open my lips,and my mouth shall proclaim your praise."
        },
        "Second_Reading": {
            "title": "Second Letter to the Corinthians5,20-21.6,1-2.",
            "reading": "Brothers and sisters: We are ambassadors for Christ, as if God were appealing through us. We implore you on behalf of Christ, be reconciled to God.\nFor our sake he made him to be sin who did not know sin, so that we might become the righteousness of God in him.\nWorking together, then, we appeal to you not to receive the grace of God in vain.\nFor he says: \"In an acceptable time I heard you, and on the day of salvation I helped you.\" Behold, now is a very acceptable time; behold, now is the day of salvation."
        },
        "Gospel": {
            "title": "Holy Gospel of Jesus Christ according to Saint Matthew6,1-6.16-18.",
            "reading": "Jesus said to his disciples: \"Take care not to perform righteous deeds in order that people may see them; otherwise, you will have no recompense from your heavenly Father.\nWhen you give alms, do not blow a trumpet before you, as the hypocrites do in the synagogues and in the streets to win the praise of others. Amen, I say to you, they have received their reward.\nBut when you give alms, do not let your left hand know what your right is doing,\nso that your almsgiving may be secret. And your Father who sees in secret will repay you.\nWhen you pray, do not be like the hypocrites, who love to stand and pray in the synagogues and on street corners so that others may see them. Amen, I say to you, they have received their reward.\nBut when you pray, go to your inner room, close the door, and pray to your Father in secret. And your Father who sees in secret will repay you.\nWhen you fast, do not look gloomy like the hypocrites. They neglect their appearance, so that they may appear to others to be fasting. Amen, I say to you, they have received their reward.\nBut when you fast, anoint your head and wash your face,\nso that you may not appear to be fasting, except to your Father who is hidden. And your Father who sees what is hidden will repay you.\""
        }
    },
    "2025-03-06": {
        "First_Reading": {
            "title": "Book of Deuteronomy30,15-20.",
            "reading": "Moses said to the people: \"Today I have set before you life and prosperity, death and doom.\nIf you obey the commandments of the LORD, your God, which I enjoin on you today, loving him, and walking in his ways, and keeping his commandments, statutes and decrees, you will live and grow numerous, and the LORD, your God, will bless you in the land you are entering to occupy.\nIf, however, you turn away your hearts and will not listen, but are led astray and adore and serve other gods,\nI tell you now that you will certainly perish; you will not have a long life on the land which you are crossing the Jordan to enter and occupy.\nI call heaven and earth today to witness against you: I have set before you life and death, the blessing and the curse. Choose life, then, that you and your descendants may live,\nby loving the LORD, your God, heeding his voice, and holding fast to him. For that will mean life for you, a long life for you to live on the land which the LORD swore he would give to your fathers Abraham, Isaac and Jacob.\""
        },
        "Psalm": {
            "title": "Psalms1,1-2.3.4.6.",
            "reading": "Blessed the man who follows notthe counsel of the wickedNor walks in the way of sinners,nor sits in the company of the insolent,\nBut delights in the law of the LORDand meditates on his law day and night.\nHe is like a treeplanted near running water,that yields its fruit in due season,and whose leaves never fade.Whatever he does, prospers.\nNot so, the wicked, not so;they are like chaff which the wind drives away.\nFor the LORD watches over the way of the just,but the way of the wicked vanishes."
        },
        "Second_Reading": {
            "title": "Holy Gospel of Jesus Christ according to Saint Luke9,22-25.",
            "reading": "Jesus said to his disciples: \"The Son of Man must suffer greatly and be rejected by the elders, the chief priests, and the scribes, and be killed and on the third day be raised.\"\nThen he said to all, \"If anyone wishes to come after me, he must deny himself and take up his cross daily and follow me.\nFor whoever wishes to save his life will lose it, but whoever loses his life for my sake will save it.\nWhat profit is there for one to gain the whole world yet lose or forfeit himself?\""
        }
    },
    "2025-03-07": {
        "First_Reading": {
            "title": "Book of Isaiah58,1-9a.",
            "reading": "Thus says the Lord GOD: Cry out full-throated and unsparingly, lift up your voice like a trumpet blast;  Tell my people their wickedness, and the house of Jacob their sins.\nThey seek me day after day, and desire to know my ways, Like a nation that has done what is just and not abandoned the law of their God; They ask me to declare what is due them, pleased to gain access to God.\n\"Why do we fast, and you do not see it? afflict ourselves, and you take no note of it?\" Lo, on your fast day you carry out your own pursuits, and drive all your laborers.\nYes, your fast ends in quarreling and fighting, striking with wicked claw. Would that today you might fast so as to make your voice heard on high!\nIs this the manner of fasting I wish, of keeping a day of penance: That a man bow his head like a reed, and lie in sackcloth and ashes? Do you call this a fast, a day acceptable to the LORD?\nThis, rather, is the fasting that I wish: releasing those bound unjustly, untying the thongs of the yoke; Setting free the oppressed, breaking every yoke;\nSharing your bread with the hungry, sheltering the oppressed and the homeless; Clothing the naked when you see them, and not turning your back on your own.\nThen your light shall break forth like the dawn, and your wound shall quickly be healed; Your vindication shall go before you, and the glory of the LORD shall be your rear guard.\nThen you shall call, and the LORD will answer, you shall cry for help, and he will say: Here I am!"
        },
        "Psalm": {
            "title": "Psalms51(50),3-4.5-6ab.18-19.",
            "reading": "Have mercy on me, O God, in your goodness;in the greatness of your compassion wipe out my offense.\nThoroughly wash me from my guiltand of my sin cleanse me.\nFor I acknowledge my offense,and my sin is before me always:\n\"Against you only have I sinned,\nand done what is evil in your sight.\"\nFor you are not pleased with sacrifices;should I offer a burnt offering, you would not accept it.\nMy sacrifice, O God, is a contrite spirit;a heart contrite and humbled, O God, you will not spurn."
        },
        "Second_Reading": {
            "title": "Holy Gospel of Jesus Christ according to Saint Matthew9,14-15.",
            "reading": "The disciples of John approached Jesus and said, \"Why do we and the Pharisees fast much, but your disciples do not fast?\"\nJesus answered them, \"Can the wedding guests mourn as long as the bridegroom is with them? The days will come when the bridegroom is taken away from them, and then they will fast.\""
        }
    },
    "2025-03-08": {
        "First_Reading": {
            "title": "Book of Isaiah58,9b-14.",
            "reading": "Thus says the LORD: If you remove from your midst oppression, false accusation and malicious speech;\nIf you bestow your bread on the hungry and satisfy the afflicted; Then light shall rise for you in the darkness, and the gloom shall become for you like midday.\nThen the LORD will guide you always and give you plenty even on the parched land. He will renew your strength, and you shall be like a watered garden, like a spring whose water never fails.\nThe ancient ruins shall be rebuilt for your sake, and the foundations from ages past you shall raise up; \"Repairer of the breach,\" they shall call you, \"Restorer of ruined homesteads.\"\nIf you hold back your foot on the sabbath from following your own pursuits on my holy day; If you call the sabbath a delight, and the LORD'S holy day honorable; If you honor it by not following your ways, seeking your own interests, or speaking with malice--\nThen you shall delight in the LORD, and I will make you ride on the heights of the earth; I will nourish you with the heritage of Jacob, your father, for the mouth of the LORD has spoken."
        },
        "Psalm": {
            "title": "Psalms86(85),1-2.3-4.5-6.",
            "reading": "Incline your ear, O LORD; answer me,for I am afflicted and poor.\nKeep my life, for I am devoted to you;save your servant who trusts in you.\nYou are my God.Have mercy on me, O Lord,for to you I call all the day.\nGladden the soul of your servant,for to you, O Lord, I lift up my soul.\nFor you, O Lord, are good and forgiving,abounding in kindness to all who call upon you.\nHearken, O LORD, to my prayerand attend to the sound of my pleading."
        },
        "Second_Reading": {
            "title": "Holy Gospel of Jesus Christ according to Saint Luke5,27-32.",
            "reading": "Jesus saw a tax collector named Levi sitting at the customs post. He said to him, \"Follow me.\"\nAnd leaving everything behind, he got up and followed him.\nThen Levi gave a great banquet for him in his house, and a large crowd of tax collectors and others were at table with them.\nThe Pharisees and their scribes complained to his disciples, saying, \"Why do you eat and drink with tax collectors and sinners?\"\nJesus said to them in reply, \"Those who are healthy do not need a physician, but the sick do.\nI have not come to call the righteous to repentance but sinners.\""
        }
    },
    "2025-03-09": {
        "First_Reading": {
            "title": "Book of Deuteronomy26,4-10.",
            "reading": "Moses spoke to the people saying: \"The priest shall then receive the basket from you and shall set it in front of the altar of the LORD, your God.\nThen you shall declare before the LORD, your God, 'My father was a wandering Aramean who went down to Egypt with a small household and lived there as an alien. But there he became a nation great, strong and numerous.\nWhen the Egyptians maltreated and oppressed us, imposing hard labor upon us,\nwe cried to the LORD, the God of our fathers, and he heard our cry and saw our affliction, our toil and our oppression.\nHe brought us out of Egypt with his strong hand and outstretched arm, with terrifying power, with signs and wonders;\nand bringing us into this country, he gave us this land flowing with milk and honey.\nTherefore, I have now brought you the first fruits of the products of the soil which you, O LORD, have given me.' And having set them before the LORD, your God, you shall bow down in his presence.\""
        },
        "Psalm": {
            "title": "Psalms91(90),1-2.10-11.12-13.14-15.",
            "reading": "You who dwell in the shelter of the Most High,who abide in the shadow of the Almighty,\nSay to the LORD, \"My refuge and my fortress,my God, in whom I trust.\"\nNo evil shall befall you,nor shall affliction come near your tent,\nfor to his angels he has given command about you,that they guard you in all your ways.\nUpon their hands they shall bear you up,lest you dash your foot against a stone.\nYou shall tread upon the asp and the viper;you shall trample down the lion and the dragon.\nBecause he clings to me, I will deliver him;I will set him on high because he acknowledges my name.\nHe shall call upon me, and I will answer him;I will be with him in distress;I will deliver him and glorify him."
        },
        "Second_Reading": {
            "title": "Letter to the Romans10,8-13.",
            "reading": "Brothers and sisters: What does scripture say? \"The word is near you, in your mouth and in your heart\" (that is, the word of faith that we preach),\nfor, if you confess with your mouth that Jesus is Lord and believe in your heart that God raised him from the dead, you will be saved.\nFor one believes with the heart and so is justified, and one confesses with the mouth and so is saved.\nFor the scripture says, \"No one who believes in him will be put to shame.\"\nFor there is no distinction between Jew and Greek; the same Lord is Lord of all, enriching all who call upon him.\nFor \"everyone who calls on the name of the Lord will be saved.\""
        },
        "Gospel": {
            "title": "Holy Gospel of Jesus Christ according to Saint Luke4,1-13.",
            "reading": "Filled with the holy Spirit, Jesus returned from the Jordan and was led by the Spirit into the desert\nfor forty days, to be tempted by the devil. He ate nothing during those days, and when they were over he was hungry.\nThe devil said to him, \"If you are the Son of God, command this stone to become bread.\"\nJesus answered him, \"It is written, 'One does not live by bread alone.'\"\nThen he took him up and showed him all the kingdoms of the world in a single instant.\nThe devil said to him, \"I shall give to you all this power and their glory; for it has been handed over to me, and I may give it to whomever I wish.\nAll this will be yours, if you worship me.\"\nJesus said to him in reply, \"It is written: 'You shall worship the Lord, your God, and him alone shall you serve.'\"\nThen he led him to Jerusalem, made him stand on the parapet of the temple, and said to him, \"If you are the Son of God, throw yourself down from here,\nfor it is written: 'He will command his angels concerning you, to guard you,'\nand: 'With their hands they will support you, lest you dash your foot against a stone.'\"\nJesus said to him in reply, \"It also says, 'You shall not put the Lord, your God, to the test.'\"\nWhen the devil had finished every temptation, he departed from him for a time."
        }
    },
    "2025-03-10": {
        "First_Reading": {
            "title": "Book of Leviticus19,1-2.11-18.",
            "reading": "The LORD said to Moses,\n\"Speak to the whole Israelite community and tell them: Be holy, for I, the LORD your God, am holy.\n\"You shall not steal. You shall not lie or speak falsely to one another.\nYou shall not swear falsely by my name, thus profaning the name of your God. I am the LORD.\n\"You shall not defraud or rob your neighbor. You shall not withhold overnight the wages of your day laborer.\nYou shall not curse the deaf, or put a stumbling block in front of the blind, but you shall fear your God. I am the LORD.\n\"You shall not act dishonestly in rendering judgment. Show neither partiality to the weak nor deference to the mighty, but judge your fellow men justly.\nYou shall not go about spreading slander among your kinsmen; nor shall you stand by idly when your neighbor's life is at stake. I am the LORD.\n\"You shall not bear hatred for your brother in your heart. Though you may have to reprove your fellow man, do not incur sin because of him.\nTake no revenge and cherish no grudge against your fellow countrymen. You shall love your neighbor as yourself. I am the LORD.\""
        },
        "Psalm": {
            "title": "Psalms19(18),8.9.10.15.",
            "reading": "The law of the LORD is perfect,refreshing the soul;The decree of the LORD is trustworthy,giving wisdom to the simple.\nThe precepts of the LORD are right,rejoicing the heart;The command of the LORD is clear,enlightening the eye.\nThe fear of the LORD is pure,enduring forever;The ordinances of the LORD are true,all of them just.\nLet the words of my mouth and the thought of my heartfind favor before you,O LORD, my rock and my redeemer."
        },
        "Second_Reading": {
            "title": "Holy Gospel of Jesus Christ according to Saint Matthew25,31-46.",
            "reading": "Jesus said to his disciples: \"When the Son of Man comes in his glory, and all the angels with him, he will sit upon his glorious throne,\nand all the nations will be assembled before him. And he will separate them one from another, as a shepherd separates the sheep from the goats.\nHe will place the sheep on his right and the goats on his left.\nThen the king will say to those on his right, 'Come, you who are blessed by my Father. Inherit the kingdom prepared for you from the foundation of the world.\nFor I was hungry and you gave me food, I was thirsty and you gave me drink, a stranger and you welcomed me,\nnaked and you clothed me, ill and you cared for me, in prison and you visited me.'\nThen the righteous will answer him and say, 'Lord, when did we see you hungry and feed you, or thirsty and give you drink?\nWhen did we see you a stranger and welcome you, or naked and clothe you?\nWhen did we see you ill or in prison, and visit you?'\nAnd the king will say to them in reply, 'Amen, I say to you, whatever you did for one of these least brothers of mine, you did for me.'\nThen he will say to those on his left, 'Depart from me, you accursed, into the eternal fire prepared for the devil and his angels.\nFor I was hungry and you gave me no food, I was thirsty and you gave me no drink,\na stranger and you gave me no welcome, naked and you gave me no clothing, ill and in prison, and you did not care for me.'\nThen they will answer and say, 'Lord, when did we see you hungry or thirsty or a stranger or naked or ill or in prison, and not minister to your needs?'\nHe will answer them, 'Amen, I say to you, what you did not do for one of these least ones, you did not do for me.'\nAnd these will go off to eternal punishment, but the righteous to eternal life.\""
        }
    },
    "2025-03-11": {
        "First_Reading": {
            "title": "Book of Isaiah55,10-11.",
            "reading": "Thus says the LORD: Just as from the heavens the rain and snow come down and do not return there till they have watered the earth, making it fertile and fruitful, giving seed to the one who sows and bread to the one who eats,\nSo shall my word be that goes forth from my mouth; It shall not return to me void, but shall do my will, achieving the end for which I sent it."
        },
        "Psalm": {
            "title": "Psalms34(33),4-5.6-7.16-17.18-19.",
            "reading": "Glorify the LORD with me,let us together extol his name.\nI sought the LORD, and he answered meand delivered me from all my fears.\nLook to him that you may be radiant with joy,and your faces may not blush with shame.\nWhen the poor one called out, the LORD heard,and from all his distress he saved him.\nThe LORD has eyes for the just,And ears for their cry.\nThe LORD confronts the evildoers,to destroy remembrance of them from the earth.\nWhen the just cry out, the LORD hears them,and from all their distress he rescues them.\nThe LORD is close to the brokenhearted;and those who are crushed in spirit he saves."
        },
        "Second_Reading": {
            "title": "Holy Gospel of Jesus Christ according to Saint Matthew6,7-15.",
            "reading": "Jesus said to his disciples:\"In praying, do not babble like the pagans, who think that they will be heard because of their many words.\nDo not be like them. Your Father knows what you need before you ask him.\nThis is how you are to pray: Our Father in heaven, hallowed be your name,\nyour kingdom come, your will be done, on earth as in heaven.\nGive us today our daily bread;\nand forgive us our debts, as we forgive our debtors;\nand do not subject us to the final test, but deliver us from the evil one.\nIf you forgive others their transgressions, your heavenly Father will forgive you.\nBut if you do not forgive others, neither will your Father forgive your transgressions.\""
        }
    },
    "2025-03-12": {
        "liturgical_week": "Wednesday of the First week of Lent",
        "readings": {
            "First_Reading": {
                "title": "Book of Jonah3,1-10.",
                "reading": "The word of the LORD came to Jonah a second time:\n\"Set out for the great city of Nineveh, and announce to it the message that I will tell you.\"\nSo Jonah made ready and went to Nineveh, according to the LORD'S bidding. Now Nineveh was an enormously large city; it took three days to go through it.\nJonah began his journey through the city, and had gone but a single day's walk announcing, \"Forty days more and Nineveh shall be destroyed,\"\nwhen the people of Nineveh believed God; they proclaimed a fast and all of them, great and small, put on sackcloth.\nWhen the news reached the king of Nineveh, he rose from his throne, laid aside his robe, covered himself with sackcloth, and sat in the ashes.\nThen he had this proclaimed throughout Nineveh, by decree of the king and his nobles: \"Neither man nor beast, neither cattle nor sheep, shall taste anything; they shall not eat, nor shall they drink water.\nMan and beast shall be covered with sackcloth and call loudly to God; every man shall turn from his evil way and from the violence he has in hand.\nWho knows, God may relent and forgive, and withhold his blazing wrath, so that we shall not perish.\"\nWhen God saw by their actions how they turned from their evil way, he repented of the evil that he had threatened to do to them; he did not carry it out."
            },
            "Psalm": {
                "title": "Psalms51(50),3-4.12-13.18-19.",
                "reading": "Have mercy on me, O God, in your goodness;in the greatness of your compassion wipe out my offense.\nThoroughly wash me from my guiltand of my sin cleanse me.\nA clean heart create for me, O God,and a steadfast spirit renew within me.\nCast me not out from your presence,and your Holy Spirit take not from me.\nFor you are not pleased with sacrifices;should I offer a burnt offering, you would not accept it.\nMy sacrifice, O God, is a contrite spirit;a heart contrite and humbled, O God, you will not spurn."
            },
            "Second_Reading": {
                "title": "Holy Gospel of Jesus Christ according to Saint Luke11,29-32.",
                "reading": "While still more people gathered in the crowd, Jesus said to them, \"This generation is an evil generation; it seeks a sign, but no sign will be given it, except the sign of Jonah.\nJust as Jonah became a sign to the Ninevites, so will the Son of Man be to this generation.\nAt the judgment the queen of the south will rise with the men of this generation and she will condemn them, because she came from the ends of the earth to hear the wisdom of Solomon, and there is something greater than Solomon here.\nAt the judgment the men of Nineveh will arise with this generation and condemn it, because at the preaching of Jonah they repented, and there is something greater than Jonah here.\""
            }
        },
        "saint_of_the_day": {
            "name": "St. Luigi Orione",
            "title": "Priest (1872-1940)",
            "profile_link": "https://dailygospel.org/AM/display-saint/b92e0414-ede2-4403-875d-7cb72c81cf7e"
        }
    },
    "2025-03-13": {
        "liturgical_week": "Thursday of the First week of Lent",
        "readings": {
            "First_Reading": {
                "title": "Book of Esther4,17n.17pqr.17aa.17bb.17gg.17hh.",
                "reading": "Queen Esther, seized with mortal anguish,had recourse to the LORD.\nShe lay prostrate upon the ground, together with her handmaids,from morning until evening, and said:\n\"God of Abraham, God of Isaac, and God of Jacob, blessed are you.Help me, who am alone and have no help but you,\nfor I am taking my life in my hand.\nAs a child I used to hear from the books of my forefathersthat you, O LORD, always free those who are pleasing to you.\nNow help me, who am alone and have no one but you,O LORD, my God.\n\"And now, come to help me, an orphan.Put in my mouth persuasive words in the presence of the lionand turn his heart to hatred for our enemy,so that he and those who are in league with him may perish.\nSave us from the hand of our enemies;turn our mourning into gladnessand our sorrows into wholeness.\""
            },
            "Psalm": {
                "title": "Psalms138(137),1-2ab.2cde-3.7c-8.",
                "reading": "I will give thanks to you, O LORD, with all my heart,for you have heard the words of my mouth;in the presence of the angels I will sing your praise;\nI will worship at your holy temple.\nI will give thanks to your name,\nbecause of your kindness and your truth.\nfor you have made great above all things\nyour name and your promise.\nWhen I called, you answered me;you built up strength within me.\nYour right hand saves me.\nThe LORD will complete what he has done for me;your kindness, O LORD, endures forever;forsake not the work of your hands."
            },
            "Second_Reading": {
                "title": "Holy Gospel of Jesus Christ according to Saint Matthew7,7-12.",
                "reading": "Jesus said to his disciples: \"Ask and it will be given to you; seek and you will find; knock and the door will be opened to you.\nFor everyone who asks, receives; and the one who seeks, finds; and to the one who knocks, the door will be opened.\nWhich one of you would hand his son a stone when he asks for a loaf of bread,\nor a snake when he asks for a fish?\nIf you then, who are wicked, know how to give good gifts to your children, how much more will your heavenly Father give good things to those who ask him.\nDo to others whatever you would have them do to you. This is the law and the prophets.\""
            }
        },
        "saint_of_the_day": {
            "name": "St. Euphrasia",
            "title": "Virgin and Martyr (+ 303)",
            "profile_link": "https://dailygospel.org/AM/display-saint/964fee0e-a36e-4d30-b771-108d02f7a457"
        }
    },
    "2025-03-14": {
        "liturgical_week": "Friday of the First week of Lent",
        "readings": {
            "First_Reading": {
                "title": "Book of Ezekiel18,21-28.",
                "reading": "Thus says the Lord GOD: If the wicked man turns away from all the sins he committed,  if he keeps all my statutes and does what is right and just, he shall surely live, he shall not die.\nNone of the crimes he committed shall be remembered against him; he shall live because of the virtue he has practiced.\nDo I indeed derive any pleasure from the death of the wicked? says the Lord GOD. Do I not rather rejoice when he turns from his evil way that he may live?\nAnd if the virtuous man turns from the path of virtue to do evil, the same kind of abominable things that the wicked man does, can he do this and still live? None of his virtuous deeds shall be remembered, because he has broken faith and committed sin; because of this, he shall die.\nYou say, \"The LORD'S way is not fair!\" Hear now, house of Israel: Is it my way that is unfair, or rather, are not your ways unfair?\nWhen a virtuous man turns away from virtue to commit iniquity, and dies, it is because of the iniquity he committed that he must die.\nBut if a wicked man, turning from the wickedness he has committed, does what is right and just, he shall preserve his life;\nsince he has turned away from all the sins which he committed, he shall surely live, he shall not die."
            },
            "Psalm": {
                "title": "Psalms130(129),1-2.3-4.5-7a.7bc-8.",
                "reading": "Out of the depths I cry to you, O LORD\nLORD, hear my voice!Let your ears be attentiveto my voice in supplication.\nIf you, O LORD, mark iniquities,LORD, who can stand?\nBut with you is forgiveness,that you may be revered.\nI trust in the LORD;my soul trusts in his word.\nMy soul waits for the Lordmore than sentinels for dawn.\nLet Israel wait for the LORD.\nFor with the LORD is kindness\nand with him is plenteous redemption;\nand he will redeem Israelfrom all their iniquities."
            },
            "Second_Reading": {
                "title": "Holy Gospel of Jesus Christ according to Saint Matthew5,20-26.",
                "reading": "Jesus said to his disciples:  \"I tell you, unless your righteousness surpasses that of the scribes and Pharisees, you will not enter into the Kingdom of heaven.\nYou have heard that it was said to your ancestors, 'You shall not kill; and whoever kills will be liable to judgment.'\nBut I say to you, whoever is angry with his brother will be liable to judgment, and whoever says to his brother, 'Raqa,' will be answerable to the Sanhedrin, and whoever says, 'You fool,' will be liable to fiery Gehenna.\nTherefore, if you bring your gift to the altar, and there recall that your brother has anything against you,\nleave your gift there at the altar, go first and be reconciled with your brother, and then come and offer your gift.\nSettle with your opponent quickly while on the way to court with him. Otherwise your opponent will hand you over to the judge, and the judge will hand you over to the guard, and you will be thrown into prison.\nAmen, I say to you, you will not be released until you have paid the last penny.\""
            }
        },
        "saint_of_the_day": {
            "name": "St. Matilde",
            "title": "Queen (c. 875-968)",
            "profile_link": "https://dailygospel.org/AM/display-saint/d9ad0fb5-8bb7-4c4a-8d81-5f3e49f98e6e"
        }
    },
    "2025-03-15": {
        "liturgical_week": "Saturday of the First week of Lent",
        "readings": {
            "First_Reading": {
                "title": "Book of Deuteronomy26,16-19.",
                "reading": "Moses spoke to the people, saying: \"This day the LORD, your God, commands you to observe these statutes and decrees. Be careful, then, to observe them with all your heart and with all your soul.\nToday you are making this agreement with the LORD: he is to be your God and you are to walk in his ways and observe his statutes, commandments and decrees, and to hearken to his voice.\nAnd today the LORD is making this agreement with you: you are to be a people peculiarly his own, as he promised you; and provided you keep all his commandments,\nhe will then raise you high in praise and renown and glory above all other nations he has made, and you will be a people sacred to the LORD, your God, as he promised.\""
            },
            "Psalm": {
                "title": "Psalms119(118),1-2.4-5.7-8.",
                "reading": "Blessed are they whose way is blameless,who walk in the law of the LORD.\nBlessed are they who observe his decrees,Who seek him with all their heart.\nYou have commanded that your preceptsbe diligently kept.\nOh, that I might be firm in the waysof keeping your statutes!\nI will give you thanks with an upright heart,when I have learned your just ordinances.\nI will keep your statutes;do not utterly forsake me."
            },
            "Second_Reading": {
                "title": "Holy Gospel of Jesus Christ according to Saint Matthew5,43-48.",
                "reading": "Jesus said to his disciples: \"You have heard that it was said, You shall love your neighbor and hate your enemy.\nBut I say to you, love your enemies, and pray for those who persecute you,\nthat you may be children of your heavenly Father, for he makes his sun rise on the bad and the good, and causes rain to fall on the just and the unjust.\nFor if you love those who love you, what recompense will you have? Do not the tax collectors do the same?\nAnd if you greet your brothers only, what is unusual about that? Do not the pagans do the same?\nSo be perfect, just as your heavenly Father is perfect.\""
            }
        },
        "saint_of_the_day": {
            "name": "St. Zachary",
            "title": "Pope (+ 752)",
            "profile_link": "https://dailygospel.org/AM/display-saint/2e95e4f1-e4b2-4944-a517-43990a8fb9e1"
        }
    },
    "2025-03-16": {
        "liturgical_week": "Second Sunday of Lent",
        "readings": {
            "First_Reading": {
                "title": "Book of Genesis15,5-12.17-18.",
                "reading": "The Lord God took Abraham outside and said: \"Look up at the sky and count the stars, if you can. Just so,\" he added, \"shall your descendants be.\"\nAbram put his faith in the LORD, who credited it to him as an act of righteousness.\nHe then said to him, \"I am the LORD who brought you from Ur of the Chaldeans to give you this land as a possession.\"\n\"O Lord GOD,\" he asked, \"How am I to know that I shall possess it?\"\nHe answered him, \"Bring me a three-year-old heifer, a three-year-old she-goat, a three-year-old ram, a turtle-dove, and a young pigeon.\"\nHe brought him all these, split them in two, and placed each half opposite the other; but the birds he did not cut up.\nBirds of prey swooped down on the carcasses, but Abram stayed with them.\nAs the sun was about to set, a trance fell upon Abram, and a deep, terrifying darkness enveloped him.\nWhen the sun had set and it was dark, there appeared a smoking brazier and a flaming torch, which passed between those pieces.\nIt was on that occasion that the LORD made a covenant with Abram, saying: \"To your descendants I give this land, from the Wadi of Egypt to the Great River (the Euphrates).\""
            },
            "Psalm": {
                "title": "Psalms27(26),1.7-8.9abc.13-14.",
                "reading": "The LORD is my light and my salvation;whom should I fear?The LORD is my life's refuge;of whom should I be afraid?\nHear, O LORD, the sound of my call;have pity on me, and answer me.\nOf you my heart speaks; you my glance seeks.\nHide not your face from me;\ndo not in anger repel your servant.\nYou are my helper: cast me not off.\nI believe that I shall see the bounty of the LORDin the land of the living.\nWait for the LORD with courage;be stouthearted, and wait for the LORD."
            },
            "Second_Reading": {
                "title": "Letter to the Philippians3,17-21.4,1.",
                "reading": "Join with others in being imitators of me, brothers and sisters, and observe those who thus conduct themselves according to the model you have in us.\nFor many, as I have often told you and now tell you even in tears, conduct themselves as enemies of the cross of Christ.\nTheir end is destruction. Their God is their stomach; their glory is in their \"shame.\" Their minds are occupied with earthly things.\nBut our citizenship is in heaven, and from it we also await a savior, the Lord Jesus Christ.\nHe will change our lowly body to conform with his glorified body by the power that enables him also to bring all things into subjection to himself.\nTherefore, my brothers, whom I love and long for, my joy and crown, in this way stand firm in the Lord, beloved."
            },
            "Gospel": {
                "title": "Holy Gospel of Jesus Christ according to Saint Luke9,28b-36.",
                "reading": "Jesus took Peter, John, and James and went up the mountain to pray.\nWhile he was praying his face changed in appearance and his clothing became dazzling white.\nAnd behold, two men were conversing with him, Moses and Elijah,\nwho appeared in glory and spoke of his exodus that he was going to accomplish in Jerusalem.\nPeter and his companions had been overcome by sleep, but becoming fully awake, they saw his glory and the two men standing with him.\nAs they were about to part from him, Peter said to Jesus, \"Master, it is good that we are here; let us make three tents, one for you, one for Moses, and one for Elijah.\" But he did not know what he was saying.\nWhile he was still speaking, a cloud came and cast a shadow over them, and they became frightened when they entered the cloud.\nThen from the cloud came a voice that said, \"This is my chosen Son; listen to him.\"\nAfter the voice had spoken, Jesus was found alone. They fell silent and did not at that time tell anyone what they had seen."
            }
        },
        "saint_of_the_day": {
            "name": "St. Heribert",
            "title": "Archbishop (c. 970-1021)",
            "profile_link": "https://dailygospel.org/AM/display-saint/ed7b2a9b-d6ac-4414-89c3-a6965933f913"
        }
    },
    "2025-03-17": {
        "liturgical_week": "Monday of the Second week of Lent",
        "readings": {
            "First_Reading": {
                "title": "Book of Daniel9,4b-10.",
                "reading": "\"Lord, great and awesome God, you who keep your merciful covenant toward those who love you and observe your commandments!\nWe have sinned, been wicked and done evil; we have rebelled and departed from your commandments and your laws.\nWe have not obeyed your servants the prophets, who spoke in your name to our kings, our princes, our fathers, and all the people of the land.\nJustice, O Lord, is on your side; we are shamefaced even to this day: the men of Judah, the residents of Jerusalem, and all Israel, near and far, in all the countries to which you have scattered them because of their treachery toward you.\nO LORD, we are shamefaced, like our kings, our princes, and our fathers, for having sinned against you.\nBut yours, O Lord, our God, are compassion and forgiveness! Yet we rebelled against you\nand paid no heed to your command, O LORD, our God, to live by the law you gave us through your servants the prophets."
            },
            "Psalm": {
                "title": "Psalms79(78),8.9.11.13.",
                "reading": "Remember not against us the iniquities of the past;May your compassion quickly come to us,For we are brought very low.\nHelp us, O God our savior,because of the glory of your name;deliver us and pardon our sinsfor your name's sake.\nLet the prisoners' sighing come before you;with your great power free those doomed to death.\nThen we, your people and the sheep of your pasture,will give thanks to you forever;through all generations we will declare your praise."
            },
            "Second_Reading": {
                "title": "Holy Gospel of Jesus Christ according to Saint Luke6,36-38.",
                "reading": "Jesus said to his disciples: \"Be merciful, just as your Father is merciful.\nStop judging and you will not be judged. Stop condemning and you will not be condemned. Forgive and you will be forgiven.\nGive and gifts will be given to you; a good measure, packed together, shaken down, and overflowing, will be poured into your lap. For the measure with which you measure will in return be measured out to you.\""
            }
        },
        "saint_of_the_day": {
            "name": "St. Patrick",
            "title": "Bishop (c. 385-461)",
            "profile_link": "https://dailygospel.org/AM/display-saint/86143e19-98bc-4676-b460-f338c76761d3"
        }
    },
    "2025-03-18": {
        "liturgical_week": "Tuesday of the Second week of Lent",
        "readings": {
            "First_Reading": {
                "title": "Book of Isaiah1,10.16-20.",
                "reading": "Hear the word of the LORD, princes of Sodom! Listen to the instruction of our God, people of Gomorrah!\nWash yourselves clean! Put away your misdeeds from before my eyes; cease doing evil;\nlearn to do good. Make justice your aim: redress the wronged, hear the orphan's plea, defend the widow.\nCome now, let us set things right, says the LORD: Though your sins be like scarlet, they may become white as snow; Though they be crimson red, they may become white as wool.\nIf you are willing, and obey, you shall eat the good things of the land;\nBut if you refuse and resist, the sword shall consume you: for the mouth of the LORD has spoken!"
            },
            "Psalm": {
                "title": "Psalms50(49),8-9.16bc-17.21.23.",
                "reading": "\"Not for your sacrifices do I rebuke you,for your burnt offerings are before me always.\nI take from your house no bullock,no goats out of your fold.\"\n\"Why do you recite my statutes,\nand profess my covenant with your mouth,\nThough you hate disciplineand cast my words behind you?\"\n\"When you do these things, shall I be deaf to it?Or do you think that I am like yourself?I will correct you by drawing them up before your eyes.\nHe that offers praise as a sacrifice glorifies me;and to him that goes the right way I will show the salvation of God.”"
            },
            "Second_Reading": {
                "title": "Holy Gospel of Jesus Christ according to Saint Matthew23,1-12.",
                "reading": "Jesus spoke to the crowds and to his disciples,\nsaying, \"The scribes and the Pharisees have taken their seat on the chair of Moses.\nTherefore, do and observe all things whatsoever they tell you, but do not follow their example. For they preach but they do not practice.\nThey tie up heavy burdens (hard to carry) and lay them on people's shoulders, but they will not lift a finger to move them.\nAll their works are performed to be seen. They widen their phylacteries and lengthen their tassels.\nThey love places of honor at banquets, seats of honor in synagogues,\ngreetings in marketplaces, and the salutation 'Rabbi.'\nAs for you, do not be called 'Rabbi.' You have but one teacher, and you are all brothers.\nCall no one on earth your father; you have but one Father in heaven.\nDo not be called 'Master'; you have but one master, the Messiah.\nThe greatest among you must be your servant.\nWhoever exalts himself will be humbled; but whoever humbles himself will be exalted.\""
            }
        },
        "saint_of_the_day": {
            "name": "St. Cyril of Jerusalem",
            "title": "Doctor of the Church (+386)",
            "profile_link": "https://dailygospel.org/AM/display-saint/6d53b9fb-50ea-407d-beee-6c61e7fa1c33"
        }
    },
    "2025-03-19": {
        "liturgical_week": "Saint Joseph, Husband of Mary",
        "readings": {
            "First_Reading": {
                "title": "2nd book of Samuel7,4-5a.12-14a.16.",
                "reading": "That night the LORD spoke to Nathan and said:\n\"Go, tell my servant David, 'Thus says the LORD: Should you build me a house to dwell in?\nAnd when your time comes and you rest with your ancestors, I will raise up your heir after you, sprung from your loins, and I will make his kingdom firm.\nIt is he who shall build a house for my name. And I will make his royal throne firm forever.\nI will be a father to him, and he shall be a son to me. And if he does wrong, I will correct him with the rod of men and with human chastisements;\nYour house and your kingdom shall endure forever before me; your throne shall stand firm forever.'\""
            },
            "Psalm": {
                "title": "Psalms89(88),2-3.4-5.27.29.",
                "reading": "The favors of the LORD I will sing forever;through all generations my mouth shall proclaim your faithfulness.\nFor you have said, “My kindness is established forever”;in heaven you have confirmed your faithfulness.\n“I have made a covenant with my chosen one,I have sworn to David my servant:\nForever will I confirm your posterityand establish your throne for all generations.”\n“He shall say of me, 'You are my father,my God, the Rock, my savior.'\nForever I will maintain my kindness toward him,and my covenant with him stands firm.”"
            },
            "Second_Reading": {
                "title": "Letter to the Romans4,13.16-18.22.",
                "reading": "Brothers and sisters: It was not through the law that the promise was made to Abraham and his descendants that he would inherit the world, but through the righteousness that comes from faith.\nFor this reason, it depends on faith, so that it may be a gift, and the promise may be guaranteed to all his descendants, not to those who only adhere to the law but to those who follow the faith of Abraham, who is the father of all of us,\nas it is written, \"I have made you father of many nations.\" He is our father in the sight of God, in whom he believed, who gives life to the dead and calls into being what does not exist.\nHe believed, hoping against hope, that he would become \"the father of many nations,\" according to what was said, \"Thus shall your descendants be.\"\nThat is why \"it was credited to him as righteousness.\""
            },
            "Gospel": {
                "title": "Holy Gospel of Jesus Christ according to Saint Matthew1,16.18-21.24a.",
                "reading": "Jacob was the father of Joseph, the husband of Mary. Of her was born Jesus who is called the Christ.\nNow this is how the birth of Jesus Christ came about. When his mother Mary was betrothed to Joseph, but before they lived together, she was found with child through the holy Spirit.\nJoseph her husband, since he was a righteous man, yet unwilling to expose her to shame, decided to divorce her quietly.\nSuch was his intention when, behold, the angel of the Lord appeared to him in a dream and said, \"Joseph, son of David, do not be afraid to take Mary your wife into your home. For it is through the holy Spirit that this child has been conceived in her.\nShe will bear a son and you are to name him Jesus, because he will save his people from their sins.\"\nWhen Joseph awoke, he did as the angel of the Lord had commanded him and took his wife into his home."
            }
        },
        "saint_of_the_day": {
            "name": "Bl. Marcel Callo",
            "title": "(1921-1945)",
            "profile_link": "https://dailygospel.org/AM/display-saint/ff855914-672d-44a8-8bb5-4c2510059a03"
        }
    },
    "2025-03-20": {
        "liturgical_week": "Thursday of the Second week of Lent",
        "readings": {
            "First_Reading": {
                "title": "Book of Jeremiah17,5-10.",
                "reading": "Thus says the LORD: Cursed is the man who trusts in human beings, who seeks his strength in flesh, whose heart turns away from the LORD.\nHe is like a barren bush in the desert that enjoys no change of season, But stands in a lava waste, a salt and empty earth.\nBlessed is the man who trusts in the LORD, whose hope is the LORD.\nHe is like a tree planted beside the waters that stretches out its roots to the stream: It fears not the heat when it comes, its leaves stay green; In the year of drought it shows no distress, but still bears fruit.\nMore tortuous than all else is the human heart, beyond remedy; who can understand it?\nI, the LORD, alone probe the mind and test the heart, To reward everyone according to his ways, according to the merit of his deeds."
            },
            "Psalm": {
                "title": "Psalms1,1-2.3.4.6.",
                "reading": "Blessed the man who follows notthe counsel of the wickedNor walks in the way of sinners,nor sits in the company of the insolent,\nBut delights in the law of the LORDand meditates on his law day and night.\nHe is like a treeplanted near running water,that yields its fruit in due season,and whose leaves never fade.Whatever he does, prospers.\nNot so, the wicked, not so;they are like chaff which the wind drives away.\nFor the LORD watches over the way of the just,but the way of the wicked vanishes."
            },
            "Second_Reading": {
                "title": "Holy Gospel of Jesus Christ according to Saint Luke16,19-31.",
                "reading": "Jesus said to the Pharisees: \"There was a rich man who dressed in purple garments and fine linen and dined sumptuously each day.\nAnd lying at his door was a poor man named Lazarus, covered with sores,\nwho would gladly have eaten his fill of the scraps that fell from the rich man's table. Dogs even used to come and lick his sores.\nWhen the poor man died, he was carried away by angels to the bosom of Abraham. The rich man also died and was buried,\nand from the netherworld, where he was in torment, he raised his eyes and saw Abraham far off and Lazarus at his side.\nAnd he cried out, 'Father Abraham, have pity on me. Send Lazarus to dip the tip of his finger in water and cool my tongue, for I am suffering torment in these flames.'\nAbraham replied, 'My child, remember that you received what was good during your lifetime while Lazarus likewise received what was bad; but now he is comforted here, whereas you are tormented.\nMoreover, between us and you a great chasm is established to prevent anyone from crossing who might wish to go from our side to yours or from your side to ours.'\nHe said, 'Then I beg you, father, send him to my father's house,\nfor I have five brothers, so that he may warn them, lest they too come to this place of torment.'\nBut Abraham replied, 'They have Moses and the prophets. Let them listen to them.'\nHe said, 'Oh no, father Abraham, but if someone from the dead goes to them, they will repent.'\nThen Abraham said, 'If they will not listen to Moses and the prophets, neither will they be persuaded if someone should rise from the dead.'\""
            }
        },
        "saint_of_the_day": {
            "name": "St. Joseph Bilczewski",
            "title": "Bishop (1860-1923)",
            "profile_link": "https://dailygospel.org/AM/display-saint/150536ba-3ba6-434e-bc88-d418088c0e34"
        }
    },
    "2025-03-21": {
        "liturgical_week": "Friday of the Second week of Lent",
        "readings": {
            "First_Reading": {
                "title": "Book of Genesis37,3-4.12-13a.17b-28.",
                "reading": "Israel loved Joseph best of all his sons, for he was the child of his old age; and he had made him a long tunic.\nWhen his brothers saw that their father loved him best of all his sons, they hated him so much that they would not even greet him.\nOne day, when his brothers had gone to pasture their father's flocks at Shechem,\nIsrael said to Joseph, \"Your brothers, you know, are tending our flocks at Shechem. Get ready; I will send you to them.\" \"I am ready,\" Joseph answered.\nThe man told him, \"They have moved on from here; in fact, I heard them say, 'Let us go on to Dothan.'\" So Joseph went after his brothers and caught up with them in Dothan.\nThey noticed him from a distance, and before he came up to them, they plotted to kill him.\nThey said to one another: \"Here comes that master dreamer!\nCome on, let us kill him and throw him into one of the cisterns here; we could say that a wild beast devoured him. We shall then see what comes of his dreams.\"\nWhen Reuben heard this, he tried to save him from their hands, saying: \"We must not take his life.\nInstead of shedding blood,\" he continued, \"just throw him into that cistern there in the desert; but don't kill him outright.\" His purpose was to rescue him from their hands and restore him to his father.\nSo when Joseph came up to them, they stripped him of the long tunic he had on;\nthen they took him and threw him into the cistern, which was empty and dry.\nThey then sat down to their meal. Looking up, they saw a caravan of Ishmaelites coming from Gilead, their camels laden with gum, balm and resin to be taken down to Egypt.\nJudah said to his brothers: \"What is to be gained by killing our brother and concealing his blood?\nRather, let us sell him to these Ishmaelites, instead of doing away with him ourselves. After all, he is our brother, our own flesh.\" His brothers agreed.\nThey sold Joseph to the Ishmaelites for twenty pieces of silver. Some Midianite traders passed by, and they pulled Joseph up out of the cistern and took him to Egypt."
            },
            "Psalm": {
                "title": "Psalms105(104),16-17.18-19.20-21.",
                "reading": "When the LORD called down a famine on the landand ruined the crop that sustained them,\nHe sent a man before them,Joseph, sold as a slave.\nThey had weighed him down with fetters,and he was bound with chains,\nTill his prediction came to passand the word of the LORD proved him true.\nThe king sent and released him,the ruler of the peoples set him free.\nHe made him lord of his houseand ruler of all his possessions."
            },
            "Second_Reading": {
                "title": "Holy Gospel of Jesus Christ according to Saint Matthew21,33-43.45-46.",
                "reading": "Jesus said to the chief priests and the elders of the people: \"Hear another parable. There was a landowner who planted a vineyard, put a hedge around it, dug a wine press in it, and built a tower. Then he leased it to tenants and went on a journey.\nWhen vintage time drew near, he sent his servants to the tenants to obtain his produce.\nBut the tenants seized the servants and one they beat, another they killed, and a third they stoned.\nAgain he sent other servants, more numerous than the first ones, but they treated them in the same way.\nFinally, he sent his son to them, thinking, 'They will respect my son.'\nBut when the tenants saw the son, they said to one another, 'This is the heir. Come, let us kill him and acquire his inheritance.'\nThey seized him, threw him out of the vineyard, and killed him.\nWhat will the owner of the vineyard do to those tenants when he comes?\"\nThey answered him, \"He will put those wretched men to a wretched death and lease his vineyard to other tenants who will give him the produce at the proper times.\"\nJesus said to them, \"Did you never read in the scriptures: 'The stone that the builders rejected has become the cornerstone; by the Lord has this been done, and it is wonderful in our eyes'?\nTherefore, I say to you, the kingdom of God will be taken away from you and given to a people that will produce its fruit.\nWhen the chief priests and the Pharisees heard his parables, they knew that he was speaking about them.\nAnd although they were attempting to arrest him, they feared the crowds, for they regarded him as a prophet."
            }
        },
        "saint_of_the_day": {
            "name": "St. Benedetta Cambiagio Frassinello",
            "title": "(1791-1858)",
            "profile_link": "https://dailygospel.org/AM/display-saint/7aefbfb5-98e3-444f-8319-314e4cadb5ad"
        }
    },
    "2025-03-22": {
        "liturgical_week": "Saturday of the Second week of Lent",
        "readings": {
            "First_Reading": {
                "title": "Book of Micah7,14-15.18-20.",
                "reading": "Shepherd your people with your staff, the flock of your inheritance, That dwells apart in a woodland, in the midst of Carmel. Let them feed in Bashan and Gilead, as in the days of old;\nAs in the days when you came from the land of Egypt, show us wonderful signs.\nWho is there like you, the God who removes guilt and pardons sin for the remnant of his inheritance; Who does not persist in anger forever, but delights rather in clemency,\nAnd will again have compassion on us, treading underfoot our guilt? You will cast into the depths of the sea all our sins;\nYou will show faithfulness to Jacob, and grace to Abraham, As you have sworn to our fathers from days of old."
            },
            "Psalm": {
                "title": "Psalms103(102),1-2.3-4.9-10.11-12.",
                "reading": "Bless the LORD, O my soul;and all my being, bless his holy name.\nBless the LORD, O my soul,and forget not all his benefits.\nHe pardons all your iniquities,he heals all your ills.\nHe redeems your life from destruction,he crowns you with kindness and compassion.\nHe will not always chide,nor does he keep his wrath forever.\nNot according to our sins does he deal with us,nor does he requite us according to our crimes.\nFor as the heavens are high above the earth,so surpassing is his kindness toward those who fear him.\nAs far as the east is from the west,so far has he put our transgressions from us."
            },
            "Second_Reading": {
                "title": "Holy Gospel of Jesus Christ according to Saint Luke15,1-3.11-32.",
                "reading": "Tax collectors and sinners were all drawing near to listen to Jesus,\nbut the Pharisees and scribes began to complain, saying, \"This man welcomes sinners and eats with them.\"\nSo to them he addressed this parable.\nThen he said, \"A man had two sons,\nand the younger son said to his father, 'Father, give me the share of your estate that should come to me.' So the father divided the property between them.\nAfter a few days, the younger son collected all his belongings and set off to a distant country where he squandered his inheritance on a life of dissipation.\nWhen he had freely spent everything, a severe famine struck that country, and he found himself in dire need.\nSo he hired himself out to one of the local citizens who sent him to his farm to tend the swine.\nAnd he longed to eat his fill of the pods on which the swine fed, but nobody gave him any.\nComing to his senses he thought, 'How many of my father's hired workers have more than enough food to eat, but here am I, dying from hunger.\nI shall get up and go to my father and I shall say to him, \"Father, I have sinned against heaven and against you.\nI no longer deserve to be called your son; treat me as you would treat one of your hired workers.\"'\nSo he got up and went back to his father. While he was still a long way off, his father caught sight of him, and was filled with compassion. He ran to his son, embraced him and kissed him.\nHis son said to him, 'Father, I have sinned against heaven and against you; I no longer deserve to be called your son.'\nBut his father ordered his servants, 'Quickly bring the finest robe and put it on him; put a ring on his finger and sandals on his feet.\nTake the fattened calf and slaughter it. Then let us celebrate with a feast,\nbecause this son of mine was dead, and has come to life again; he was lost, and has been found.' Then the celebration began.\nNow the older son had been out in the field and, on his way back, as he neared the house, he heard the sound of music and dancing.\nHe called one of the servants and asked what this might mean.\nThe servant said to him, 'Your brother has returned and your father has slaughtered the fattened calf because he has him back safe and sound.'\nHe became angry, and when he refused to enter the house, his father came out and pleaded with him.\nHe said to his father in reply, 'Look, all these years I served you and not once did I disobey your orders; yet you never gave me even a young goat to feast on with my friends.\nBut when your son returns who swallowed up your property with prostitutes, for him you slaughter the fattened calf.'\nHe said to him, 'My son, you are here with me always; everything I have is yours.\nBut now we must celebrate and rejoice, because your brother was dead and has come to life again; he was lost and has been found.'\""
            }
        },
        "saint_of_the_day": {
            "name": "Bl. Cardinal August von Galen",
            "title": "Bishop (1933-1946)",
            "profile_link": "https://dailygospel.org/AM/display-saint/8ee4d94f-0cc1-417a-ba89-4a8747dea2f3"
        }
    },
    "2025-03-23": {
        "liturgical_week": "Third Sunday of Lent",
        "readings": {
            "First_Reading": {
                "title": "Book of Exodus3,1-8a.13-15.",
                "reading": "Moses was tending the flock of his father-in-law Jethro, the priest of Midian. Leading the flock across the desert, he came to Horeb, the mountain of God.\nThere an angel of the LORD appeared to him in fire flaming out of a bush. As he looked on, he was surprised to see that the bush, though on fire, was not consumed.\nSo Moses decided, \"I must go over to look at this remarkable sight, and see why the bush is not burned.\"\nWhen the LORD saw him coming over to look at it more closely, God called out to him from the bush, \"Moses! Moses!\" He answered, \"Here I am.\"\nGod said, \"Come no nearer! Remove the sandals from your feet, for the place where you stand is holy ground.\nI am the God of your father,\" he continued, \"the God of Abraham, the God of Isaac, the God of Jacob.\" Moses hid his face, for he was afraid to look at God.\nBut the LORD said, \"I have witnessed the affliction of my people in Egypt and have heard their cry of complaint against their slave drivers, so I know well what they are suffering.\nTherefore I have come down to rescue them from the hands of the Egyptians and lead them out of that land into a good and spacious land, a land flowing with milk and honey, the country of the Canaanites, Hittites, Amorites, Perizzites, Hivites and Jebusites.\n\"But,\" said Moses to God, \"when I go to the Israelites and say to them, 'The God of your fathers has sent me to you,' if they ask me, 'What is his name?' what am I to tell them?\"\nGod replied, \"I am who am.\" Then he added, \"This is what you shall tell the Israelites: I AM sent me to you.\"\nGod spoke further to Moses, \"Thus shall you say to the Israelites: The LORD, the God of your fathers, the God of Abraham, the God of Isaac, the God of Jacob, has sent me to you. \"This is my name forever; this is my title for all generations."
            },
            "Psalm": {
                "title": "Psalms103(102),1-2.3-4.6-7.8.11.",
                "reading": "Bless the LORD, O my soul;and all my being, bless his holy name.\nBless the LORD, O my soul,and forget not all his benefits.\nHe pardons all your iniquities,he heals all your ills.\nHe redeems your life from destruction,he crowns you with kindness and compassion.\nThe LORD secures justiceand the rights of all the oppressed.\nHe has made known his ways to Moses,and his deeds to the children of Israel.\nMerciful and gracious is the LORD,slow to anger and abounding in kindness.\nFor as the heavens are high above the earth,so surpassing is his kindness toward those who fear him."
            },
            "Second_Reading": {
                "title": "First Letter to the Corinthians10,1-6.10-12.",
                "reading": "I do not want you to be unaware, brothers and sisters, that our ancestors were all under the cloud and all passed through the sea,\nand all of them were baptized into Moses in the cloud and in the sea.\nAll ate the same spiritual food,\nand all drank the same spiritual drink, for they drank from a spiritual rock that followed them, and the rock was the Christ.\nYet God was not pleased with most of them, for they were struck down in the desert.\nThese things happened as examples for us, so that we might not desire evil things, as they did.\nDo not grumble as some of them did, and suffered death by the destroyer.\nThese things happened to them as an example, and they have been written down as a warning to us, upon whom the end of the ages has come.\nTherefore, whoever thinks he is standing secure should take care not to fall."
            },
            "Gospel": {
                "title": "Holy Gospel of Jesus Christ according to Saint Luke13,1-9.",
                "reading": "Some people told Jesus about the Galileans whose blood Pilate had mingled with the blood of their sacrifices.\nHe said to them in reply, \"Do you think that because these Galileans suffered in this way they were greater sinners than all other Galileans?\nBy no means! But I tell you, if you do not repent, you will all perish as they did!\nOr those eighteen people who were killed when the tower at Siloam fell on them --do you think they were more guilty than everyone else who lived in Jerusalem?\nBy no means! But I tell you, if you do not repent, you will all perish as they did!\"\nAnd he told them this parable: \"There once was a person who had a fig tree planted in his orchard, and when he came in search of fruit on it but found none,\nhe said to the gardener, 'For three years now I have come in search of fruit on this fig tree but have found none. (So) cut it down. Why should it exhaust the soil?'\nHe said to him in reply, 'Sir, leave it for this year also, and I shall cultivate the ground around it and fertilize it;\nit may bear fruit in the future. If not you can cut it down.'\""
            }
        },
        "saint_of_the_day": {
            "name": "St. Turibius of Mongrovejo",
            "title": "Bishop (1538-1606)",
            "profile_link": "https://dailygospel.org/AM/display-saint/d0f970e9-cfa6-4260-b24b-a4c40db05d8a"
        }
    },
    "2025-03-24": {
        "liturgical_week": "Monday of the Third week of Lent",
        "readings": {
            "First_Reading": {
                "title": "2nd book of Kings5,1-15a.",
                "reading": "Naaman, the army commander of the king of Aram, was highly esteemed and respected by his master, for through him the LORD had brought victory to Aram. But valiant as he was, the man was a leper.\nNow the Arameans had captured from the land of Israel in a raid a little girl, who became the servant of Naaman's wife.\n\"If only my master would present himself to the prophet in Samaria,\" she said to her mistress, \"he would cure him of his leprosy.\"\nNaaman went and told his lord just what the slave girl from the land of Israel had said.\n\"Go,\" said the king of Aram. \"I will send along a letter to the king of Israel.\" So Naaman set out, taking along ten silver talents, six thousand gold pieces, and ten festal garments.\nTo the king of Israel he brought the letter, which read: \"With this letter I am sending my servant Naaman to you, that you may cure him of his leprosy.\"\nWhen he read the letter, the king of Israel tore his garments and exclaimed: \"Am I a god with power over life and death, that this man should send someone to me to be cured of leprosy? Take note! You can see he is only looking for a quarrel with me!\"\nWhen Elisha, the man of God, heard that the king of Israel had torn his garments, he sent word to the king: \"Why have you torn your garments? Let him come to me and find out that there is a prophet in Israel.\"\nNaaman came with his horses and chariots and stopped at the door of Elisha's house.\nThe prophet sent him the message: \"Go and wash seven times in the Jordan, and your flesh will heal, and you will be clean.\"\nBut Naaman went away angry, saying, \"I thought that he would surely come out and stand there to invoke the LORD his God, and would move his hand over the spot, and thus cure the leprosy.\nAre not the rivers of Damascus, the Abana and the Pharpar, better than all the waters of Israel? Could I not wash in them and be cleansed?\" With this, he turned about in anger and left.\nBut his servants came up and reasoned with him. \"My father,\" they said, \"if the prophet had told you to do something extraordinary, would you not have done it? All the more now, since he said to you, 'Wash and be clean,' should you do as he said.\"\nSo Naaman went down and plunged into the Jordan seven times at the word of the man of God. His flesh became again like the flesh of a little child, and he was clean.\nHe returned with his whole retinue to the man of God. On his arrival he stood before him and said, \"Now I know that there is no God in all the earth, except in Israel. Please accept a gift from your servant.\""
            },
            "Psalm": {
                "title": "Psalms42(41),2-3.43(42),3-4.",
                "reading": "As the hind longs for the running waters,so my soul longs for you, O God.\nAthirst is my soul for God, the living God.When shall I go and behold the face of God?\nSend forth your light and your fidelity;they shall lead me onAnd bring me to your holy mountain,to your dwelling place.\nThen will I go in to the altar of God,the God of my gladness and joy;Then will I give you thanks upon the harp,O God, my God!"
            },
            "Second_Reading": {
                "title": "Holy Gospel of Jesus Christ according to Saint Luke4,24-30.",
                "reading": "Jesus said to the people in the synagogue at Nazareth: \"Amen, I say to you, no prophet is accepted in his own native place.\nIndeed, I tell you, there were many widows in Israel in the days of Elijah when the sky was closed for three and a half years and a severe famine spread over the entire land.\nIt was to none of these that Elijah was sent, but only to a widow in Zarephath in the land of Sidon.\nAgain, there were many lepers in Israel during the time of Elisha the prophet; yet not one of them was cleansed, but only Naaman the Syrian.\"\nWhen the people in the synagogue heard this, they were all filled with fury.\nThey rose up, drove him out of the town, and led him to the brow of the hill on which their town had been built, to hurl him down headlong.\nBut he passed through the midst of them and went away."
            }
        },
        "saint_of_the_day": {
            "name": "St. Catherine of Sweden",
            "title": "Abbess (1330 + 1381)",
            "profile_link": "https://dailygospel.org/AM/display-saint/74ccfe3a-9144-460b-94a7-8dc69dc5dba3"
        }
    },
    "2025-03-25": {
        "liturgical_week": "Annunciation of the Lord - Solemnity",
        "readings": {
            "First_Reading": {
                "title": "Book of Isaiah7,10-14.8,10b.",
                "reading": "The LORD spoke to Ahaz, saying:\nAsk for a sign from the LORD, your God; let it be deep as the nether world, or high as the sky!\nBut Ahaz answered, \"I will not ask! I will not tempt the LORD!\"\nThen he said: Listen, O house of David! Is it not enough for you to weary men, must you also weary my God?\nTherefore the Lord himself will give you this sign: the virgin shall be with child, and bear a son, and shall name him Emmanuel.\nwhich means “God is with us!”"
            },
            "Psalm": {
                "title": "Psalms40(39),7-8a.8b-9.10.11.",
                "reading": "Sacrifice or oblation you wished not,but ears open to obedience you gave me.Burnt offerings or sin-offerings you sought not;\nthen said I, “Behold I come.”\n“In the written scroll it is prescribed for me,\nTo do your will, O my God, is my delight,and your law is within my heart!”\nI announced your justice in the vast assembly;I did not restrain my lips, as you, O LORD, know.\nYour justice I kept not hid within my heart;your faithfulness and your salvation I have spoken of;I have made no secret of your kindness and your truthin the vast assembly."
            },
            "Second_Reading": {
                "title": "Letter to the Hebrews10,4-10.",
                "reading": "Brothers and sisters: it is impossible that the blood of bulls and goats take away sins.\nFor this reason, when he came into the world, he said: \"Sacrifice and offering you did not desire, but a body you prepared for me;\nholocausts and sin offerings you took no delight in.\nThen I said, 'As is written of me in the scroll, Behold, I come to do your will, O God.'\"\nFirst he says, \"Sacrifices and offerings, holocausts and sin offerings, you neither desired nor delighted in.\" These are offered according to the law.\nThen he says, \"Behold, I come to do your will.\" He takes away the first to establish the second.\nBy this \"will,\" we have been consecrated through the offering of the body of Jesus Christ once for all."
            },
            "Gospel": {
                "title": "Holy Gospel of Jesus Christ according to Saint Luke1,26-38.",
                "reading": "In the sixth month, the angel Gabriel was sent from God to a town of Galilee called Nazareth,\nto a virgin betrothed to a man named Joseph, of the house of David, and the virgin's name was Mary.\nAnd coming to her, he said, \"Hail, full of grace! The Lord is with you.\"\nBut she was greatly troubled at what was said and pondered what sort of greeting this might be.\nThen the angel said to her, \"Do not be afraid, Mary, for you have found favor with God.\nBehold, you will conceive in your womb and bear a son, and you shall name him Jesus.\nHe will be great and will be called Son of the Most High, and the Lord God will give him the throne of David his father,\nand he will rule over the house of Jacob forever, and of his kingdom there will be no end.\"\nBut Mary said to the angel, \"How can this be, since I have no relations with a man?\"\nAnd the angel said to her in reply, \"The Holy Spirit will come upon you, and the power of the Most High will overshadow you. Therefore the child to be born will be called holy, the Son of God.\nAnd behold, Elizabeth, your relative, has also conceived a son in her old age, and this is the sixth month for her who was called barren;\nfor nothing will be impossible for God.\"\nMary said, \"Behold, I am the handmaid of the Lord. May it be done to me according to your word.\" Then the angel departed from her."
            }
        },
        "saint_of_the_day": {
            "name": "Bl. Omeljan Kovč",
            "title": "(1884-1944)",
            "profile_link": "https://dailygospel.org/AM/display-saint/048afafc-a2c3-496e-9606-592c9fbedcc0"
        }
    },
    "2025-03-26": {
        "liturgical_week": "Wednesday of the Third week of Lent",
        "readings": {
            "First_Reading": {
                "title": "Book of Deuteronomy4,1.5-9.",
                "reading": "Moses spoke to the people and said: \"Now, Israel, hear the statutes and decrees which I am teaching you to observe, that you may live, and may enter in and take possession of the land which the LORD, the God of your fathers, is giving you.\nTherefore, I teach you the statutes and decrees as the LORD, my God, has commanded me, that you may observe them in the land you are entering to occupy.\nObserve them carefully, for thus will you give evidence of your wisdom and intelligence to the nations, who will hear of all these statutes and say, 'This great nation is truly a wise and intelligent people.'\nFor what great nation is there that has gods so close to it as the LORD, our God, is to us whenever we call upon him?\nOr what great nation has statutes and decrees that are as just as this whole law which I am setting before you today?\"\n\"However, take care and be earnestly on your guard not to forget the things which your own eyes have seen, nor let them slip from your memory as long as you live, but teach them to your children and to your children's children.\""
            },
            "Psalm": {
                "title": "Psalms147,12-13.15-16.19-20.",
                "reading": "Glorify the LORD, O Jerusalem;praise your God, O Zion.\nFor he has strengthened the bars of your gates;he has blessed your children within you.\nHe sends forth his command to the earth;swiftly runs his word!\nHe spreads snow like wool;frost he strews like ashes.\nHe has proclaimed his word to Jacob,his statutes and his ordinances to Israel.\nHe has not done thus for any other nation;his ordinances he has not made known to them. Alleluia"
            },
            "Second_Reading": {
                "title": "Holy Gospel of Jesus Christ according to Saint Matthew5,17-19.",
                "reading": "Jesus said to his disciples: \"Do not think that I have come to abolish the law or the prophets. I have come not to abolish but to fulfill.\nAmen, I say to you, until heaven and earth pass away, not the smallest letter or the smallest part of a letter will pass from the law, until all things have taken place.\nTherefore, whoever breaks one of the least of these commandments and teaches others to do so will be called least in the kingdom of heaven. But whoever obeys and teaches these commandments will be called greatest in the kingdom of heaven.\""
            }
        },
        "saint_of_the_day": {
            "name": "St. Ludger",
            "title": "Bishop (c. 743-809)",
            "profile_link": "https://dailygospel.org/AM/display-saint/1e9cc023-ff9a-46f7-b082-0c381f849ef6"
        }
    },
    "2025-03-27": {
        "liturgical_week": "Thursday of the Third week of Lent",
        "readings": {
            "First_Reading": {
                "title": "Book of Jeremiah7,23-28.",
                "reading": "Thus says the LORD: This is what I commanded my people: Listen to my voice; then I will be your God and you shall be my people. Walk in all the ways that I command you, so that you may prosper.\nBut they obeyed not, nor did they pay heed. They walked in the hardness of their evil hearts and turned their backs, not their faces, to me.\nFrom the day that your fathers left the land of Egypt even to this day, I have sent you untiringly all my servants the prophets.\nYet they have not obeyed me nor paid heed; they have stiffened their necks and done worse than their fathers.\nWhen you speak all these words to them, they will not listen to you either; when you call to them, they will not answer you.\nSay to them: This is the nation which does not listen to the voice of the LORD, its God, or take correction. Faithfulness has disappeared; the word itself is banished from their speech."
            },
            "Psalm": {
                "title": "Psalms95(94),1-2.6-7.8-9.",
                "reading": "Come, let us sing joyfully to the LORD;let us acclaim the Rock of our salvation.\nLet us come into his presence with thanksgiving;let us joyfully sing psalms to him.\nCome, let us bow down in worship;let us kneel before the LORD who made us.\nFor he is our God,and we are the people he shepherds, the flock he guides.\nOh, that today you would hear his voice:“Harden not your hearts as at Meribah,as in the day of Massah in the desert,\nWhere your fathers tempted me;they tested me though they had seen my works.”"
            },
            "Second_Reading": {
                "title": "Holy Gospel of Jesus Christ according to Saint Luke11,14-23.",
                "reading": "Jesus was driving out a demon that was mute, and when the demon had gone out, the mute man spoke and the crowds were amazed.\nSome of them said, \"By the power of Beelzebul, the prince of demons, he drives out demons.\"\nOthers, to test him, asked him for a sign from heaven.\nBut he knew their thoughts and said to them, \"Every kingdom divided against itself will be laid waste and house will fall against house.\nAnd if Satan is divided against himself, how will his kingdom stand? For you say that it is by Beelzebul that I drive out demons.\nIf I, then, drive out demons by Beelzebul, by whom do your own people drive them out? Therefore they will be your judges.\nBut if it is by the finger of God that I drive out demons, then the kingdom of God has come upon you.\nWhen a strong man fully armed guards his palace, his possessions are safe.\nBut when one stronger than he attacks and overcomes him, he takes away the armor on which he relied and distributes the spoils.\nWhoever is not with me is against me, and whoever does not gather with me scatters.\""
            }
        },
        "saint_of_the_day": {
            "name": "St. John of Egypt",
            "title": "(+ 394)",
            "profile_link": "https://dailygospel.org/AM/display-saint/7a1a307b-27d7-45ce-820e-ea7373de37d8"
        }
    },
    "2025-03-28": {
        "liturgical_week": "Friday of the Third week of Lent",
        "readings": {
            "First_Reading": {
                "title": "Book of Hosea14,2-10.",
                "reading": "Thus says the LORD: Return, O Israel, to the LORD, your God; you have collapsed through your guilt.\nTake with you words, and return to the LORD; Say to him, \"Forgive all iniquity, and receive what is good, that we may render as offerings the bullocks from our stalls.\nAssyria will not save us, nor shall we have horses to mount; We shall say no more, 'Our god,' to the work of our hands; for in you the orphan finds compassion.\"\nI will heal their defection, I will love them freely; for my wrath is turned away from them.\nI will be like the dew for Israel: he shall blossom like the lily; He shall strike root like the Lebanon cedar,\nand put forth his shoots. His splendor shall be like the olive tree and his fragrance like the Lebanon cedar.\nAgain they shall dwell in his shade and raise grain; They shall blossom like the vine, and his fame shall be like the wine of Lebanon.\nEphraim! What more has he to do with idols? I have humbled him, but I will prosper him. \"I am like a verdant cypress tree\"-- Because of me you bear fruit!\nLet him who is wise understand these things; let him who is prudent know them. Straight are the paths of the LORD, in them the just walk, but sinners stumble in them."
            },
            "Psalm": {
                "title": "Psalms81(80),6c-8a.8bc-9.10-11ab.14.17.",
                "reading": "An unfamiliar speech I hear:\n“I relieved his shoulder of the burden;his hands were freed from the basket.\nIn distress you called, and I rescued you.”\n“Unseen, I answered you in thunder;\nI tested you at the waters of Meribah.\nHear, my people, and I will admonish you;O Israel, will you not hear me?”\n“There shall be no strange god among younor shall you worship any alien god.\nI, the LORD, am your God\nwho led you forth from the land of Egypt.\"\n\"If only my people would hear me,and Israel walk in my ways,\nWhile Israel I would feed with the best of wheat,and with honey from the rock I would fill them.”"
            },
            "Second_Reading": {
                "title": "Holy Gospel of Jesus Christ according to Saint Mark12,28b-34.",
                "reading": "One of the scribes came to Jesus and asked him, \"Which is the first of all the commandments?\"\nJesus replied, \"The first is this: 'Hear, O Israel! The Lord our God is Lord alone!\nYou shall love the Lord your God with all your heart, with all your soul, with all your mind, and with all your strength.'\nThe second is this: 'You shall love your neighbor as yourself.' There is no other commandment greater than these.\"\nThe scribe said to him, \"Well said, teacher. You are right in saying, 'He is One and there is no other than he.'\nAnd 'to love him with all your heart, with all your understanding, with all your strength, and to love your neighbor as yourself' is worth more than all burnt offerings and sacrifices.\"\nAnd when Jesus saw that (he) answered with understanding, he said to him, \"You are not far from the kingdom of God.\" And no one dared to ask him any more questions."
            }
        },
        "saint_of_the_day": {
            "name": "St. Gontran",
            "title": "King (545-592)",
            "profile_link": "https://dailygospel.org/AM/display-saint/d68d57b4-657d-4314-ac86-47a5ae66a78e"
        }
    },
    "2025-03-29": {
        "liturgical_week": "Saturday of the Third week of Lent",
        "readings": {
            "First_Reading": {
                "title": "Book of Hosea6,1-6.",
                "reading": "Come, let us return to the LORD, it is he who has rent, but he will heal us; he has struck us, but he will bind our wounds.\nHe will revive us after two days; on the third day he will raise us up, to live in his presence.\nLet us know, let us strive to know the LORD; as certain as the dawn is his coming, and his judgment shines forth like the light of day! He will come to us like the rain, like spring rain that waters the earth.\"\nWhat can I do with you, Ephraim? What can I do with you, Judah? Your piety is like a morning cloud, like the dew that early passes away.\nFor this reason I smote them through the prophets, I slew them by the words of my mouth;\nFor it is love that I desire, not sacrifice, and knowledge of God rather than holocausts."
            },
            "Psalm": {
                "title": "Psalms51(50),3-4.18-19.20-21ab.",
                "reading": "Have mercy on me, O God, in your goodness;in the greatness of your compassion wipe out my offense.\nThoroughly wash me from my guiltand of my sin cleanse me.\nFor you are not pleased with sacrifices;should I offer a burnt offering, you would not accept it.\nMy sacrifice, O God, is a contrite spirit;a heart contrite and humbled, O God, you will not spurn.\nBe bountiful, O LORD, to Zion in your kindnessby rebuilding the walls of Jerusalem;\nThen shall you be pleased with due sacrifices,\nburnt offerings and holocausts."
            },
            "Second_Reading": {
                "title": "Holy Gospel of Jesus Christ according to Saint Luke18,9-14.",
                "reading": "Jesus addressed this parable to those who were convinced of their own righteousness and despised everyone else.\n\"Two people went up to the temple area to pray; one was a Pharisee and the other was a tax collector.\nThe Pharisee took up his position and spoke this prayer to himself, 'O God, I thank you that I am not like the rest of humanity--greedy, dishonest, adulterous--or even like this tax collector.\nI fast twice a week, and I pay tithes on my whole income.'\nBut the tax collector stood off at a distance and would not even raise his eyes to heaven but beat his breast and prayed, 'O God, be merciful to me a sinner.'\nI tell you, the latter went home justified, not the former; for everyone who exalts himself will be humbled, and the one who humbles himself will be exalted.\""
            }
        },
        "saint_of_the_day": {
            "name": "St. Gladys",
            "title": "Hermit (5th century)",
            "profile_link": "https://dailygospel.org/AM/display-saint/53c39839-367f-4e66-9632-a41c23b8d986"
        }
    },
    "2025-03-30": {
        "liturgical_week": "Fourth Sunday of Lent (Laetare)",
        "readings": {
            "First_Reading": {
                "title": "Book of Joshua5,9a.10-12.",
                "reading": "The the LORD said to Joshua, \"Today I have removed the reproach of Egypt from you.\" Therefore the place is called Gilgal to the present day.\nWhile the Israelites were encamped at Gilgal on the plains of Jericho, they celebrated the Passover on the evening of the fourteenth of the month.\nOn the day after the Passover they ate of the produce of the land in the form of unleavened cakes and parched grain. On that same day\nafter the Passover on which they ate of the produce of the land, the manna ceased. No longer was there manna for the Israelites, who that year ate of the yield of the land of Canaan."
            },
            "Psalm": {
                "title": "Psalms34(33),2-3.4-5.6-7.",
                "reading": "I will bless the LORD at all times;his praise shall be ever in my mouth.\nLet my soul glory in the LORD;the lowly will hear me and be glad.\nGlorify the LORD with me,let us together extol his name.\nI sought the LORD, and he answered meand delivered me from all my fears.\nLook to him that you may be radiant with joy,and your faces may not blush with shame.\nWhen the poor one called out, the LORD heard,and from all his distress he saved him."
            },
            "Second_Reading": {
                "title": "Second Letter to the Corinthians5,17-21.",
                "reading": "Brothers and sisters:  Whoever is in Christ is a new creation:  the old things have passed away;  behold, new things have come.\nAnd all this is from God, who has reconciled us to himself through Christ and given us the ministry of reconciliation,\nnamely, God was reconciling the world to himself in Christ, not counting their trespasses against them and entrusting to us the message of reconciliation.\nSo we are ambassadors for Christ, as if God were appealing through us. We implore you on behalf of Christ, be reconciled to God.\nFor our sake he made him to be sin who did not know sin, so that we might become the righteousness of God in him."
            },
            "Gospel": {
                "title": "Holy Gospel of Jesus Christ according to Saint Luke15,1-3.11-32.",
                "reading": "Tax collectors and sinners were all drawing near to listen to Jesus,\nbut the Pharisees and scribes began to complain, saying, \"This man welcomes sinners and eats with them.\"\nSo to them he addressed this parable.\nThen he said, \"A man had two sons,\nand the younger son said to his father, 'Father, give me the share of your estate that should come to me.' So the father divided the property between them.\nAfter a few days, the younger son collected all his belongings and set off to a distant country where he squandered his inheritance on a life of dissipation.\nWhen he had freely spent everything, a severe famine struck that country, and he found himself in dire need.\nSo he hired himself out to one of the local citizens who sent him to his farm to tend the swine.\nAnd he longed to eat his fill of the pods on which the swine fed, but nobody gave him any.\nComing to his senses he thought, 'How many of my father's hired workers have more than enough food to eat, but here am I, dying from hunger.\nI shall get up and go to my father and I shall say to him, \"Father, I have sinned against heaven and against you.\nI no longer deserve to be called your son; treat me as you would treat one of your hired workers.\"'\nSo he got up and went back to his father. While he was still a long way off, his father caught sight of him, and was filled with compassion. He ran to his son, embraced him and kissed him.\nHis son said to him, 'Father, I have sinned against heaven and against you; I no longer deserve to be called your son.'\nBut his father ordered his servants, 'Quickly bring the finest robe and put it on him; put a ring on his finger and sandals on his feet.\nTake the fattened calf and slaughter it. Then let us celebrate with a feast,\nbecause this son of mine was dead, and has come to life again; he was lost, and has been found.' Then the celebration began.\nNow the older son had been out in the field and, on his way back, as he neared the house, he heard the sound of music and dancing.\nHe called one of the servants and asked what this might mean.\nThe servant said to him, 'Your brother has returned and your father has slaughtered the fattened calf because he has him back safe and sound.'\nHe became angry, and when he refused to enter the house, his father came out and pleaded with him.\nHe said to his father in reply, 'Look, all these years I served you and not once did I disobey your orders; yet you never gave me even a young goat to feast on with my friends.\nBut when your son returns who swallowed up your property with prostitutes, for him you slaughter the fattened calf.'\nHe said to him, 'My son, you are here with me always; everything I have is yours.\nBut now we must celebrate and rejoice, because your brother was dead and has come to life again; he was lost and has been found.'\""
            }
        },
        "saint_of_the_day": {
            "name": "St. John Climacus",
            "title": "Anchorite (6th-7th centuries)",
            "profile_link": "https://dailygospel.org/AM/display-saint/d9e46b75-d1ce-45b8-9532-c006c13309bd"
        }
    },
    "2025-03-31": {
        "liturgical_week": "Monday of the Fourth week of Lent",
        "readings": {
            "First_Reading": {
                "title": "Book of Isaiah65,17-21.",
                "reading": "Thus says the LORD: Lo, I am about to create new heavens and a new earth; The things of the past shall not be remembered or come to mind.\nInstead, there shall always be rejoicing and happiness in what I create; For I create Jerusalem to be a joy and its people to be a delight;\nI will rejoice in Jerusalem and exult in my people. No longer shall the sound of weeping be heard there, or the sound of crying;\nNo longer shall there be in it an infant who lives but a few days, or an old man who does not round out his full lifetime; He dies a mere youth who reaches but a hundred years, and he who fails of a hundred shall be thought accursed.\nThey shall live in the houses they build, and eat the fruit of the vineyards they plant."
            },
            "Psalm": {
                "title": "Psalms30(29),2.4.5-6.11-12a.13b.",
                "reading": "I will extol you, O LORD, for you drew me clearand did not let my enemies rejoice over me.\nO LORD, you brought me up from the nether world;you preserved me from among those going down into the pit.\nSing praise to the LORD, you his faithful ones,and give thanks to his holy name.\nFor his anger lasts but a moment;a lifetime, his good will.\nAt nightfall, weeping enters in,but with the dawn, rejoicing.\nHear, O LORD, and have pity on me;O LORD, be my helper.”\nYou changed my mourning into dancing;O LORD, my God, forever will I give you thanks."
            },
            "Second_Reading": {
                "title": "Holy Gospel of Jesus Christ according to Saint John4,43-54.",
                "reading": "At that time Jesus left [Samaria] for Galilee.\nFor Jesus himself testified that a prophet has no honor in his native place.\nWhen he came into Galilee, the Galileans welcomed him, since they had seen all he had done in Jerusalem at the feast; for they themselves had gone to the feast.\nThen he returned to Cana in Galilee, where he had made the water wine. Now there was a royal official whose son was ill in Capernaum.\nWhen he heard that Jesus had arrived in Galilee from Judea, he went to him and asked him to come down and heal his son, who was near death.\nJesus said to him, \"Unless you people see signs and wonders, you will not believe.\"\nThe royal official said to him, \"Sir, come down before my child dies.\"\nJesus said to him, \"You may go; your son will live.\" The man believed what Jesus said to him and left.\nWhile he was on his way back, his slaves met him and told him that his boy would live.\nHe asked them when he began to recover. They told him, \"The fever left him yesterday, about one in the afternoon.\"\nThe father realized that just at that time Jesus had said to him, \"Your son will live,\" and he and his whole household came to believe.\n(Now) this was the second sign Jesus did when he came to Galilee from Judea."
            }
        },
        "saint_of_the_day": {
            "name": "St. Benjamin",
            "title": "Deacon and Martyr (c. 424)",
            "profile_link": "https://dailygospel.org/AM/display-saint/8836b80d-87f0-4134-beeb-a6b2b80daa14"
        }
    },
    "2025-04-01": {
        "liturgical_week": "Tuesday of the Fourth week of Lent",
        "readings": {
            "First_Reading": {
                "title": "Book of Ezekiel47,1-9.12.",
                "reading": "The angel brought me, Ezekiel, back to the entrance of the temple of the LORD, and I saw water flowing out from beneath the threshold of the temple toward the east, for the façade of the temple was toward the east; the water flowed down from the right side of the temple, south of the altar.\nHe led me outside by the north gate, and around to the outer gate facing the east, where I saw water trickling from the southern side.\nThen when he had walked off to the east with a measuring cord in his hand, he measured off a thousand cubits and had me wade through the water, which was ankle-deep.\nHe measured off another thousand and once more had me wade through the water, which was now knee-deep. Again he measured off a thousand and had me wade; the water was up to my waist.\nOnce more he measured off a thousand, but there was now a river through which I could not wade; for the water had risen so high it had become a river that could not be crossed except by swimming.\nHe asked me, \"Have you seen this, son of man?\" Then he brought me to the bank of the river, where he had me sit.\nAlong the bank of the river I saw very many trees on both sides.\nHe said to me, \"This water flows into the eastern district down upon the Arabah, and empties into the sea, the salt waters, which it makes fresh.\nWherever the river flows, every sort of living creature that can multiply shall live, and there shall be abundant fish, for wherever this water comes the sea shall be made fresh.\nAlong both banks of the river, fruit trees of every kind shall grow; their leaves shall not fade, nor their fruit fail. Every month they shall bear fresh fruit, for they shall be watered by the flow from the sanctuary. Their fruit shall serve for food, and their leaves for medicine.\""
            },
            "Psalm": {
                "title": "Psalms46(45),2-3.5-6.8-9.",
                "reading": "God is our refuge and our strength,an ever-present help in distress.\nTherefore, we fear not, though the earth be shakenand mountains plunge into the depths of the sea.\nThere is a stream whose runlets gladden the city of God,the holy dwelling of the Most High.\nGod is in its midst; it shall not be disturbed;God will help it at the break of dawn.\nThe LORD of hosts is with us;our stronghold is the God of Jacob.\nCome! behold the deeds of the LORD,the astounding things he has wrought on earth."
            },
            "Second_Reading": {
                "title": "Holy Gospel of Jesus Christ according to Saint John5,1-16.",
                "reading": "There was a feast of the Jews, and Jesus went up to Jerusalem.\nNow there is in Jerusalem at the Sheep (Gate) a pool called in Hebrew Bethesda, with five porticoes.\nIn these lay a large number of ill, blind, lame, and crippled.\n\nOne man was there who had been ill for thirty-eight years.\nWhen Jesus saw him lying there and knew that he had been ill for a long time, he said to him, \"Do you want to be well?\"\nThe sick man answered him, \"Sir, I have no one to put me into the pool when the water is stirred up; while I am on my way, someone else gets down there before me.\"\nJesus said to him, \"Rise, take up your mat, and walk.\"\nImmediately the man became well, took up his mat, and walked. Now that day was a sabbath.\nSo the Jews said to the man who was cured, \"It is the sabbath, and it is not lawful for you to carry your mat.\"\nHe answered them, \"The man who made me well told me, 'Take up your mat and walk.'\"\nThey asked him, \"Who is the man who told you, 'Take it up and walk'?\"\nThe man who was healed did not know who it was, for Jesus had slipped away, since there was a crowd there.\nAfter this Jesus found him in the temple area and said to him, \"Look, you are well; do not sin any more, so that nothing worse may happen to you.\"\nThe man went and told the Jews that Jesus was the one who had made him well.\nTherefore, the Jews began to persecute Jesus because he did this on a sabbath."
            }
        },
        "saint_of_the_day": {
            "name": "St. Hugh",
            "title": "Bishop (1053-1132)",
            "profile_link": "https://dailygospel.org/AM/display-saint/1951f1ad-2300-4133-b2fe-c7460dfd8049"
        }
    }
}